#pragma once

// Name: S3Demo, Version: 0.90.0

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass ABP_S3_ACCharacter.ABP_S3_ACCharacter_C
// 0x9511 (0x9FB1 - 0x0AA0)
class UABP_S3_ACCharacter_C : public US3NPCAnimInstance
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                           // 0x0AA0(0x0008) (Transient, DuplicateTransient)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_52210BC14664AA63D88EBC840928A4C9;// 0x0AA8(0x0048)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_7FA1CD85402742DED78706A240780226;// 0x0AF0(0x0048)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0B38(0x0008) MISSED OFFSET
	struct FAnimNode_TwoBoneIK                         AnimGraphNode_TwoBoneIK_DE91B1CB4C6FF3A350402A85D49012E9; // 0x0B40(0x0270)
	struct FAnimNode_TwoBoneIK                         AnimGraphNode_TwoBoneIK_EF5F7C0349BB05A3F8A141AFCD07CCFD; // 0x0DB0(0x0270)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_B1AF5D2D4BE882D50B33DEBBFDAE9540;// 0x1020(0x0160)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_2DD3F2AD4ABEDA317983A4AE85825B61;// 0x1180(0x0160)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_7C26BAC84C2BE914E05636A67B51DA92;// 0x12E0(0x00E0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_F73D4F0642580567C6EE44B017447C39;// 0x13C0(0x00E0)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_6B3DC3054386BAAF8FE773A27AEFC850;      // 0x14A0(0x0070)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_83E31F3844927C45DD716FA22F27D8F6;// 0x1510(0x00E0)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_83B7655F442A71740F5986A17F894304;      // 0x15F0(0x0070)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_41CD11334BC7E8ED65D32EA009FBA13B;// 0x1660(0x0050)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_7E8DCA884BF2DEFD886F9C9210E1C829;// 0x16B0(0x00E0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_038493204534D41A0EEC90BAFF16F221;// 0x1790(0x00E0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_1F54A9B14CE06ECEF71D8AB7720D381A;// 0x1870(0x0050)
	struct FAnimNode_SubInstance                       AnimGraphNode_SubInstance_3BA4AF0F487137065C341AA002A56F06;// 0x18C0(0x00C8)
	struct FAnimNode_Root                              AnimGraphNode_Root_7622DC8A4B9B838CF3E2AAB100EB3CCC;      // 0x1988(0x0048)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_B3231F284E6934900B77B4930DAF3B85;// 0x19D0(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E3EDA4EF49725C0F16950C91F18DEC3E;// 0x1AB0(0x00B0)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_F1AB6B6142ABFEFC195FF59DBF6CDBD3;// 0x1B60(0x0048)
	unsigned char                                      UnknownData01[0x8];                                       // 0x1BA8(0x0008) MISSED OFFSET
	struct FAnimNode_TwoBoneIK                         AnimGraphNode_TwoBoneIK_B0B79DDC4867771D0D899D857D648A8C; // 0x1BB0(0x0270)
	struct FAnimNode_TwoBoneIK                         AnimGraphNode_TwoBoneIK_5B7B80DF4BF3542313FBCDB51E9CAAC4; // 0x1E20(0x0270)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_D6787A424C070A308B21BD886DF24D1C;// 0x2090(0x00E0)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_1A3399E741A086DF2B5A18BCE5992B3E;// 0x2170(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_0709743E4069FD31A85B6EA340D52209;// 0x21B8(0x00B0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_5E80273F4C35850011D571BC5C587FC2;// 0x2268(0x00D0)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_79900B0A4CC1B2996E726385A5A33DC4;// 0x2338(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_47A39AB5416879C5CFF64D9B29705A3D;// 0x2418(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A57DE77F4EF4A09F6882B3B4A737A139;// 0x24C8(0x00B0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_418B0A9D4D975D1B1B216EA848D6EF8B;// 0x2578(0x00D0)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_525DAD9647F3292DA2DDAE913F9634C8;// 0x2648(0x00E0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_4FD83E2B4EF0F83FC43E969F3029FD9B;// 0x2728(0x00D0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_F6D798F74BD57435CC50D18236A8E825;// 0x27F8(0x0128)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_D9EA50244486763513B8C28FECB7AC3C;// 0x2920(0x00E0)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8C46C8C648EA32D72FEE9481182A3584;// 0x2A00(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7A1938CC400AF168CAB4C1A4D510BD8C;// 0x2A48(0x0048)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_6D28B0F0448484EC6C8BCF8745FA32F8;// 0x2A90(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7AE976BF49B91EF3E70F33BE48C2CB7A;// 0x2AD8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_34D00444436A3A43B0C8B68352C407DE;// 0x2B20(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B959B555411748087A7BD1803D9CBC45;// 0x2B68(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_70463538411F1960FA174CACB8C2CA4C;// 0x2BB0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DC90ADDF4215F41E9641F9812432934B;// 0x2BF8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E213179B4768FFBFDF4855B083D7D94C;// 0x2C40(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D5E1C680466B8FB8C82A7D923EDEBCC0;// 0x2C88(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_569D8A8F4BBAA8934C9136A8397D5DB0;// 0x2CD0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_578BBEEF4E14AFEBAD4AAF8FE93421A6;// 0x2D18(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_337A6C8043DD5080A4B97BBF2CFE557D;// 0x2D60(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4907ACD347F488E29DB228B49805D642;// 0x2DA8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4479C4A24EB2657AFAE6FE8C1FA83C68;// 0x2DF0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_091F83534162741142046F80B7155FED;// 0x2E38(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D3F6A2134A4EBD519B536F9E9A78EA6D;// 0x2E80(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_02A6B3A34E483E60F29CD981BCD64E57;// 0x2EC8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_75943A2540627354E5152FB77E6DE16D;// 0x2F10(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_678816904F6448668AF249926C9111AF;// 0x2F58(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DE522AB24AC739F70E6BF5B915EC82C6;// 0x2FA0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D0E2221E4F01D5D0826BFDAD92ABDE3A;// 0x2FE8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BA415D004925BB786A14648D46104CC2;// 0x3030(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7C83B805430A2740ADDD508B561FBC3E;// 0x3078(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2D0E0D024EE4E90EB98F90976CA2C5B9;// 0x30C0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6A13528347ECCB765F53B3B50881681C;// 0x3108(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D6E929F04E8380EC8BCA40B4B0164DB8;// 0x3150(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_19DB195A4933A91B182F40985B75C628;// 0x3198(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7D5566BC45B06DFC7B3A09B87A14505D;// 0x31E0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A842759346BC5A8F704155B259DAB37D;// 0x3228(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7553334C4C150136469D2AB26A9B7D4B;// 0x3270(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B8F5182D4DCD70484F9DBCA9858C053B;// 0x32B8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_709F1EAD4819A6F751193FB3AE733F73;// 0x3300(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CEFEAF254AE043B23DA8E2A02485E7EB;// 0x3348(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_860D8A4F4D9D8439E20744B147F94889;// 0x3390(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3E138D30428E6702E40A3C98094E1A88;// 0x33D8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E263A1B442FE7EC228A8F489EB68F56B;// 0x3420(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C00D56B340EBC2B5A8237882FD86C50E;// 0x3468(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2DD3C4174B302B85AA990DBFFF4AFAF1;// 0x34B0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_76FFEC5449BD7DFC3F609183ABB0F70B;// 0x34F8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DE63984043F2D84199E3D79F00DF18AE;// 0x3540(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0EB033C9458D3E7E9330BABB85D776C8;// 0x3588(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_24E1D87C434B74349ACB668B83A4C6A3;// 0x35D0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_864C0B9B42806125839CCC9B93C89009;// 0x3618(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0C5D9F17402C6A4DCA000E8A7D034EF5;// 0x3660(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B82BC7FA40CC88BE7452FDB27344DBC5;// 0x36A8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_165BF649404B428998EA468A908BFB47;// 0x36F0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AB365F6848F6448AEDE1E98DDCEDC0D8;// 0x3738(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AF0E6B0C4CF6EE84B718D087A628597A;// 0x3780(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_EEABCB9441D7EF6683D8F1B35D6981ED;// 0x37C8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3EC58DFE449E8FEA26A2F9954E973C7B;// 0x3810(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9CCE352F4BB929987776CEB409A4334B;// 0x3858(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_ADA399F948FFC1FAC376A0A96DA1C876;// 0x38A0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_77988A884DF9C541256BB291ECFB4B84;// 0x38E8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A570EBA44B55AC893DFF788DECE46C71;// 0x3930(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C6B456354BAA000E615A1C862DD86A37;// 0x3978(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_517CEB1240552AAA08C8F58AA45F855C;// 0x39C0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CFE31D8E4AE4DC20FF6ECFB0276A567B;// 0x3A08(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8262408E46B258F6994B64A9F232BC83;// 0x3A50(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A6EC6430433F98061F0A2FB2840DFA32;// 0x3A98(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_09326915472FCF0E74352F8F8B2C4E9D;// 0x3AE0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4E084A274307A87F88C9B699E125F8BE;// 0x3B28(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_EF01BAB942BD6FC0ECE5BE918F1F6983;// 0x3B70(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3DB0E50E418DF32766B5F49B748C6463;// 0x3BB8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2E4C50B64C72E9AC2D40F996F6F6C371;// 0x3C00(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_04EF840D422E1287B976D7ACB67D1270;// 0x3C48(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_79871FD2424DB9547C0D89AD0BF239AB;// 0x3C90(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B052A2764C6C72CDEB5DC086FBFFBB30;// 0x3CD8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8EE1B0744044B0FD8E2F98A304FB98B0;// 0x3D20(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C23F4C3B4FFAC7EE16094AA26DEC3085;// 0x3D68(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A6B8D398401016D8871A2995F61675C7;// 0x3DB0(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_C27EE882471B18AB47E436B41D3F9221;// 0x3E60(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_4751D18E4F57D201488E629B15CD1E65;// 0x3EA8(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_BB691D9E45FE3112715D3B87B315A99C;// 0x3F58(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_9D1EE9B94112643C5843C082804EAE15;// 0x3FA0(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_F8EB492843366DBB2C8659A553DF2D90;// 0x40C8(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_A06C90AD4443C300E8AE5BA370D9966D;// 0x4110(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_0A77EE2C40BAC5051F105290639367B5;// 0x4238(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B1EFC79C45E034AE118B61B83FDBE328;// 0x4280(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_F4B4F45F429BC818C68468A63DD49535;// 0x4330(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_0BA44724489902BF72F3D697AA9A8D3F;// 0x4378(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_C920750B49E2F05C80FA719688CAF958;// 0x4428(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F6BC0EE243621FF5D2F4329ED46B41AD;// 0x4470(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_3D08693147AEC4ECA9AAC98A6AD8B5ED;// 0x4520(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5F49332947C8B41340DA8F8E8FB39AD6;// 0x4568(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_8C3D463E4801BC5CC17806990B5CAB31;// 0x4618(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9A8E886E47C705B9FAD215A8F65465CD;// 0x4660(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_06AD867646C765A594D4BCA928FCC3AC;// 0x4710(0x0048)
	struct FAnimNode_S3ScaleRootMotion                 AnimGraphNode_S3ScaleRootMotion_0C431CC942659896647841A4E77737CB;// 0x4758(0x0050)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_4B3B6FF64BFE73B48CD933B0EFA8BEAE;// 0x47A8(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_F7EC2A2049189564EE658099102A9A57;// 0x4858(0x0048)
	struct FAnimNode_S3ScaleRootMotion                 AnimGraphNode_S3ScaleRootMotion_24660DF64D3DCECC7F9D2683D72DE5F4;// 0x48A0(0x0050)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D8A45C2B4A95D7461E5B64B551726A49;// 0x48F0(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_5272ABB642F6B03D221776BDCE2A7662;// 0x49A0(0x0048)
	struct FAnimNode_S3ScaleRootMotion                 AnimGraphNode_S3ScaleRootMotion_650C19E34971E81E8F8D6F9787DDB2FC;// 0x49E8(0x0050)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_FB782992410113424E09C8867F7E051E;// 0x4A38(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_A3A23B1240B24EE60AD25FBDF4E0032C;// 0x4AE8(0x0048)
	struct FAnimNode_S3ScaleRootMotion                 AnimGraphNode_S3ScaleRootMotion_D4DEC85745E7ADF28CC0ACAA31CEBBF0;// 0x4B30(0x0050)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B70C2E164424242375187BAC5397EDA9;// 0x4B80(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_E51E5B564EA767A25F27C4BE953C947A;// 0x4C30(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F927A1D64102721DC5575B8633D9AD4D;// 0x4C78(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_0F751B544458E1C1FD7F1ABFE3C63CD2;// 0x4D28(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_AF0DA3FA452C5FD3417E5C8D0EF0A8C8;// 0x4D70(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_4E9A39B64FF9A1B0C8A39194D6145589;// 0x4E20(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_4220CF664831EC6911D689A1F87B727E;// 0x4E68(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_1670B7384D9108C0D7F7FA8F986B8E5B;// 0x4F90(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_13EA7EAE406E94D5B2F82699D590A763;// 0x4FD8(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_097D80784F9E44AF32BC8AB412BB2A95;// 0x5088(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_11C89A1149B7EC6AC7F8D69CA959660F;// 0x50D0(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_201156F744593A4BCD59A19ABA77DEE3;// 0x5180(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A17DDA6B41EAC7531B136FAE22C3DB51;// 0x51C8(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_4132A4CC48396406858985903C57B0FB;// 0x5278(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_D8B84812415E77ABB1BEBE842BFDA3C9;// 0x52C0(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_A6AAE0184F0C1F933D044C92F91B00CA;// 0x53E8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_7663EB64461DEAC0E66FC890D2495A35;// 0x5430(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_9052930B435AA9947B1214A9702BAB4D;// 0x54E0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_1C02550B460092C2F55C1484EDF15B22;// 0x5528(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_B050601C417D0FC98C878E9A67F86DDA;// 0x55D8(0x0048)
	struct FAnimNode_S3DistanceDriver                  AnimGraphNode_S3DistanceDriver_38F4A4574C45AF370B761EB214FAE5E9;// 0x5620(0x00F0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_37C0D5794B5080D609C04EA415FB7023;// 0x5710(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A06FF97D40EDB6E7FFAE3FAF013548BC;// 0x57E0(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_370D5BCF40D844F95511849A2129A48A;// 0x5890(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B78E5B6049B259F6C53834942B74E6B0;// 0x58D8(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_6B8E01CF4951A08B98CC9EA2FE674FD2;// 0x5988(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_158754FF4E59006821465C8C87600C17;// 0x59D0(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_33840E7F4561A05EE91CD2B2A6235EE2;// 0x5A80(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_386C16DA4B22669AD5B19187B7B67A12;// 0x5AC8(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_EF005FFB4648033F82001DA85A2CEC7A;// 0x5B78(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F1D166A64E9615815124BAA82A4E04F6;// 0x5BC0(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_5076EBAA4C8060A041DD279F3057DA21;// 0x5C70(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_DDD32859471FC74C785FF9AF8CB74684;// 0x5CB8(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_4B42EE4C492ABF32B358B3A0A1602CF7;// 0x5D68(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_919AC2A04FA9185827F4DC88F219379C;// 0x5DB0(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_9C78003544D80666886672BAE42010A9;// 0x5E60(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_19FD21F64C0A4CB41CB06B807C84D489;// 0x5EA8(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_AAF9C65D40B61A7C139F53852F77E2B1;// 0x5F58(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D2CBDC0342E2EEC319DAD7840CB4F211;// 0x5FA0(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_5365FF6C4715959D629F1294582A245B;// 0x6050(0x0048)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_A949E9094B6A703B4135188AC3F85BE6;// 0x6098(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_0EA15D1F4F7C70525D915D97DFFB0F6E;// 0x6178(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_902D012D4659707F64CDEC9E7EEA13E1;// 0x6228(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_C45326FD445D503FF58F85A193CC295B;// 0x62D8(0x0048)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_15C1D54E4F8B9ECEEB8DC1910E8EDB39;// 0x6320(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A50034C640C869010123F384BA657F8B;// 0x6400(0x00B0)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_A4574E754E36A7D945C874984B04C8DB;// 0x64B0(0x0048)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_C7CBCAF34655A2CD677958A8F8C01597;// 0x64F8(0x0048)
	struct FAnimNode_S3SpeedWarping                    AnimGraphNode_S3SpeedWarping_D299022D453586B912EE75A09D1B9A7C;// 0x6540(0x0180)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_958F91CE4BB79542E31323AE35B4A599;// 0x66C0(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_5932B88E4565452236149DBC172EA926;// 0x6770(0x0048)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_E4E440754B7129EE9D5BB9A6787B4EA9;// 0x67B8(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2D8BC68F44A076AEBFD06EA9E3E01A10;// 0x6898(0x00B0)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_48E70F8C4E277A2820B1BDA961017D5B;// 0x6948(0x0048)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_EFA5843747104BF742321880F05045C2;// 0x6990(0x0048)
	struct FAnimNode_S3SpeedWarping                    AnimGraphNode_S3SpeedWarping_3E81B7F04E0565EF0016FE99C95C3359;// 0x69D8(0x0180)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5F41D2D44AF67FAF1CAC95859E93DBB2;// 0x6B58(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_95834B034905293826ED63ADDE7EF420;// 0x6C08(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E5B40AB14333E38D1ACE7591D6EFDED5;// 0x6C50(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_A13B4BCF46BABF91B997F4B4E7306043;// 0x6D00(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_0BC3A9EC45AAB909C80F31B44D2C880C;// 0x6D48(0x00E0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_729E616C4A2ECB1BFD6458BEF698B57B;// 0x6E28(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_C1C22C0342DF4B2F973C0991173157EB;// 0x6E70(0x00E0)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_413B6C274E6422B6DADEF58497DF70C0;// 0x6F50(0x00E0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_F8E08B7F467BB3FF2F1D15A7ACC31A30;// 0x7030(0x0050)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_FB28796846AE44DA8BC91BAB1BEB95A9;// 0x7080(0x00E0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_4DD3FA7A4385F0774E0A1280F4875095;// 0x7160(0x00E0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_AEE1ABE94080C7FD7ACDAE9F834E6E14;// 0x7240(0x0050)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_F7B0A9334E324FC0FEF5C3AF0AA91255;// 0x7290(0x0050)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_D780519044902033B925A1AF6040D1E9;// 0x72E0(0x0128)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9E8A14324D525B05CA679592C14D5FC0;// 0x7408(0x00B0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_D4D441534CAE79E94FE9A091F8AA0F46;// 0x74B8(0x00D0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_E54F0A8447BF0C5DE4D1A983D49F8A03;// 0x7588(0x00D0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_AE27EFFA4C6E4E51460A1EA17DB7388B;// 0x7658(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F68111014FC5EAD9383907BE451161CF;// 0x7728(0x00B0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_1844A3E24300F4FFEEC255832D0CC0EC;// 0x77D8(0x00D0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_1DFF154D40EA788EEF7385B45B15D85F;// 0x78A8(0x00D0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_FB8BA695436655B06EBA709DBE1FB952;// 0x7978(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_6169B54C4DD021BA9DC22D9F89EDAA30;// 0x7AA0(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_594328A0494A192C29296CB1C2B7C3C1;// 0x7BC8(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_060034EC4B8CD885AA0CC8B3CB646651;// 0x7CF0(0x0128)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_DFAF7E7B48428CBCCAFD28983C5D3C4C;// 0x7E18(0x00D0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_DA7381A841467AC15D45D0A3EBE0A427;// 0x7EE8(0x0128)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_F1EC4C2D43668D8B73CA489F63F5F743;// 0x8010(0x00D0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_4418E22543E4B9C65AB7C58BA9FE43DD;// 0x80E0(0x00D0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_5F1A4754403BF6959CD4FDA792165DCE;// 0x81B0(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_3BDE2EDA41E75B81671A4985599EC936;// 0x82D8(0x0128)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_32D301ED4CE1BD2D65ECE9953E02349B;// 0x8400(0x00E0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_356B409D4A369AD929D36A986C0C1216;// 0x84E0(0x00D0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_58E93D704EE5C5FD3007A8B35DF19550;// 0x85B0(0x00D0)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_2ACAE34F457DCAE0E7DF1A8A0ECA79DD;// 0x8680(0x00E0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_52D3C983486F5BF9F81137B59525821C;// 0x8760(0x0050)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_EF7D1BDB43038074B13BCDA9E6AE4EE0;// 0x87B0(0x0050)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_77C333574C1086A9BFB57FB90778DF03;// 0x8800(0x00D0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_918AFC0A46FEA7767B06E2800E78A64D;// 0x88D0(0x0050)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_C8AC37CF4AC4236EBF1842983540AC21;// 0x8920(0x0050)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_CC345D814C05D5DEC964D8907BAA6BFC;// 0x8970(0x0050)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_903CFB1842A92D44305D6A938F41477A;// 0x89C0(0x0050)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_5AE71F36450E92E614AA70A1E6BE0519;// 0x8A10(0x00D0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_9C5A3D5F4F8321B58D768695353CB78C;// 0x8AE0(0x0050)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_9BE4640240A8158AE30DF2BE98ED6A17;// 0x8B30(0x00D0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_0680E5034BB964CA77820AB4E4E760AC;// 0x8C00(0x0050)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_9211CF5347245E63505F90BCFA5A1FFA;// 0x8C50(0x00D0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_B095B0A049028FAA77CC1AAE4CD27C4E;// 0x8D20(0x0128)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_B61307A74B3AE544B0E82DB347CEA015;// 0x8E48(0x00E0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_4CE17CEB44251E0E00CAAFAC549704E7;// 0x8F28(0x0050)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_8C36D2CE439F2B6689978E8A7DC6FA31;// 0x8F78(0x0050)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_CB95F9094739B009A3C66FBA30471F31;// 0x8FC8(0x0160)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_2C5DAF2D453F2C6B43B9C89DB819C4B3;// 0x9128(0x0048)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_043A6256457A7CD0DB9BC8BA70202498;// 0x9170(0x00D0)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_57634B234EE9970039402B9E2EAE18FB;// 0x9240(0x0048)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_1B00BA3F44A381CB0AA8318B051E1D59;// 0x9288(0x00E0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_5547FD8A4C2A329A224CB7AE59007C76;// 0x9368(0x0050)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_AD1560484F880DC9CBE30E95A481E773;// 0x93B8(0x0050)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_613241A345B92B8202FED7B3D19799E5;// 0x9408(0x00D0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_B50902A74F84EE1299C7BC827E63B123;// 0x94D8(0x0050)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_591EF92B4C2CEAC155EDD8AEB152478D;// 0x9528(0x0050)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_5FF269CE4FE111C407DC82AAA7B9AD5A;// 0x9578(0x0160)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_15F71C6948A5B5271132DBA9C73943D0;// 0x96D8(0x0048)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_F09A1AA74E732BD699B48D9AE30255FA;// 0x9720(0x00E0)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_25A040624373212E9146A8A14C0AB3C5;// 0x9800(0x0160)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_076800874AE8A307DD7B76AAB9AF9E05;// 0x9960(0x0160)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_A69B2A5543F9C8F71F228D82D3C3C77B;// 0x9AC0(0x00D0)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_00995B604B8CC630DCFFC189EC7370D0;// 0x9B90(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_C5F78DA54C88194643A4229AEF9F7D9C;// 0x9BD8(0x0050)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_A09D8007444B27115A0317B68BB25C10;// 0x9C28(0x0050)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_57F79D3C464FC478A5C3988C49E2C021;// 0x9C78(0x0050)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_733F07F7489F702C70EBF586685C04C6;// 0x9CC8(0x0160)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_06AB11D7478D87F7D2E7CDBBD55A4C05;// 0x9E28(0x0160)
	bool                                               UseFootPlanting;                                          // 0x9F88(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData02[0x7];                                       // 0x9F89(0x0007) MISSED OFFSET
	TArray<struct FST_NPC_AttachInfo>                  AttachInfoArray;                                          // 0x9F90(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class ABP_S3_ACCharacter_C*                        ACCharacter;                                              // 0x9FA0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData)
	struct FName                                       CharaName;                                                // 0x9FA8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               UseJointAnim;                                             // 0x9FB0(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AnimBlueprintGeneratedClass ABP_S3_ACCharacter.ABP_S3_ACCharacter_C");
		return ptr;
	}


	void SetCharaName(const struct FName& NewName);
	bool IsReadyTalk();
	void AttachAnimObject(ENPCAttachFrom From, class AActor* Actor, class USkeletalMeshComponent* SkMeshComp, const struct FName& SocketName, bool IsSpawn);
	void Attach_DefinitionFromHaveItem(struct FHaveItemAttachSetting* haveItem);
	void DetachAll();
	void GetAttachInfo(class UBP_AnimNotify_Attach_C* Notify, struct FST_NPC_AttachInfo* Info);
	void AttachStaticObject(ENPCAttachFrom From, class AActor* Actor, class UStaticMeshComponent* MeshComp, const struct FName& SocketName, bool IsSpwan);
	void Attach(struct FNPCAttachSetting* Setting);
