#pragma once

// Name: S3Demo, Version: 0.90.0

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass ABP_notepadPageA6.ABP_notepadPageA6_C
// 0x0E09 (0x1169 - 0x0360)
class UABP_notepadPageA6_C : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                           // 0x0360(0x0008) (Transient, DuplicateTransient)
	struct FAnimNode_Root                              AnimGraphNode_Root_2B6577A84950B662797699A745FB0412;      // 0x0368(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_742994B24989F680D98E1882E916EBAA;// 0x03B0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AD144246495070F91258BF8BE3295D83;// 0x03F8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8AEB364B40D4CC6F21A204BC447F4100;// 0x0440(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CBB2361645C6F1CF0C088DB955419247;// 0x0488(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F52407D6490CD0A6BF5C9A835C7777CE;// 0x04D0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2E5B93DF463FD881274EA38857D5116B;// 0x0518(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2B70E7614F868BB751F3DCB381E4C448;// 0x0560(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_ABD45F4649649C21678483A21DC4AE6D;// 0x05A8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_EB4FF6B542E5D315039E029AFF0A5DF7;// 0x05F0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_EE68B04C4FD97AC5BCB507AA35453330;// 0x0638(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1745950545B668A55AEDDEAE9EEC1503;// 0x0680(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_03D4F5C84C41B6B8165757AD3C7173FC;// 0x06C8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A20680F44AB4DD8795C749A4E153D17F;// 0x0710(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_58E01DDE4CE76B52965E6E9794AEC7BE;// 0x0758(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6BDB16D34D754DDB3300689F26AD1971;// 0x07A0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B1566B8A439DF27BD5D3038333528293;// 0x07E8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C22661E148D55A6FCE919799F1CE3B17;// 0x0830(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_5C90D08B4863FADE63F07BB89A5EF9DE;// 0x08E0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_DCC0D4634780DF7F98ABEBBCAB23B047;// 0x0928(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_E3ABAD02452F6114230AC1AB018EA419;// 0x09D8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_35A17F3345B57A54FA53AC8498FCBF59;// 0x0A20(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_15DAE6A44363833631C6EC971F3FBF1F;// 0x0AD0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3546655B432BA381A464B58FF98E62FE;// 0x0B18(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_B275D4B1435C09477A36F08964743AB1;// 0x0BC8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B6980D5E4E37AA2F4337D5B4C6D0036A;// 0x0C10(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A8333AB7453DD73A2DA52781489278C4;// 0x0C58(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C4ECA52242363094239D18B70CE633AB;// 0x0CA0(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_A9D0089948C9B9297BAB11B4199ABB88;// 0x0D50(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C53A9F8D4F937FBF89F38F93CC305D58;// 0x0D98(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_C222CDA94BEAA69F6D9AFDA18EAD4734;// 0x0E48(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_932B3F604D9CED994865DFBF2743A450;// 0x0E90(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_3A4FED8E442E596119475D9E2FA82C7F;// 0x0F40(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2C0F10234BBD819B8ADA0599623F3533;// 0x0F88(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_B264B75B4946CF93B9921083A6CD46FD;// 0x1038(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_2560CE26482AE3EF62421C94C2D62146;// 0x1080(0x00E0)
	class ABP_S3Memopad_page_C*                        PageActor;                                                // 0x1160(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	TEnumAsByte<EN_memopadTurntype>                    TurnState;                                                // 0x1168(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AnimBlueprintGeneratedClass ABP_notepadPageA6.ABP_notepadPageA6_C");
		return ptr;
	}


	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_notepadPageA6_AnimGraphNode_TransitionResult_2E5B93DF463FD881274EA38857D5116B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_notepadPageA6_AnimGraphNode_TransitionResult_2B70E7614F868BB751F3DCB381E4C448();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_notepadPageA6_AnimGraphNode_TransitionResult_ABD45F4649649C21678483A21DC4AE6D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_notepadPageA6_AnimGraphNode_TransitionResult_CBB2361645C6F1CF0C088DB955419247();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_notepadPageA6_AnimGraphNode_TransitionResult_EB4FF6B542E5D315039E029AFF0A5DF7();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_notepadPageA6_AnimGraphNode_TransitionResult_EE68B04C4FD97AC5BCB507AA35453330();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_notepadPageA6_AnimGraphNode_TransitionResult_1745950545B668A55AEDDEAE9EEC1503();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_notepadPageA6_AnimGraphNode_TransitionResult_03D4F5C84C41B6B8165757AD3C7173FC();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_notepadPageA6_AnimGraphNode_TransitionResult_8AEB364B40D4CC6F21A204BC447F4100();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_notepadPageA6_AnimGraphNode_TransitionResult_A20680F44AB4DD8795C749A4E153D17F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_notepadPageA6_AnimGraphNode_TransitionResult_58E01DDE4CE76B52965E6E9794AEC7BE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_notepadPageA6_AnimGraphNode_TransitionResult_6BDB16D34D754DDB3300689F26AD1971();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_notepadPageA6_AnimGraphNode_TransitionResult_B1566B8A439DF27BD5D3038333528293();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_notepadPageA6_AnimGraphNode_TransitionResult_AD144246495070F91258BF8BE3295D83();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_notepadPageA6_AnimGraphNode_TransitionResult_742994B24989F680D98E1882E916EBAA();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_notepadPageA6_AnimGraphNode_TransitionResult_F52407D6490CD0A6BF5C9A835C7777CE();
	void BlueprintUpdateAnimation(float* DeltaTimeX);
	void BlueprintInitializeAnimation();
	void AnimNotify_notepad();
	void ExecuteUbergraph_ABP_notepadPageA6(int EntryPoint);
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
