#pragma once

// Name: S3Demo, Version: 0.90.0

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct ST_AreaData.ST_AreaData
// 0x0058
struct FST_AreaData
{
	struct FText                                       EyecatchMain_13_EA9DD15E41FC6CB376B062A4745BEF2A;         // 0x0000(0x0018) (Edit, BlueprintVisible)
	struct FText                                       EyecatchSub_14_FCA3FB914F55FA827F4E9B8FB1B45E00;          // 0x0018(0x0018) (Edit, BlueprintVisible)
	struct FText                                       EyecatchHans_22_D5C26884481EF811449A4B904AD4C1A0;         // 0x0030(0x0018) (Edit, BlueprintVisible)
	ES3LoadingType                                     LoadingType_17_DB947F454BA56EE3E4F9A9A20E043CA8;          // 0x0048(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0049(0x0007) MISSED OFFSET
	struct FName                                       LocaLabel_25_54AC338C4E53AD7FAC2CFAB4641E06EF;            // 0x0050(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
