#pragma once

// Name: S3Demo, Version: 0.90.0

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass ABP_Fishing_re.ABP_Fishing_re_C
// 0x585C (0x5BBC - 0x0360)
class UABP_Fishing_re_C : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                           // 0x0360(0x0008) (Transient, DuplicateTransient)
	struct FAnimNode_Root                              AnimGraphNode_Root_CF163DAF411969FADD48178CAF818695;      // 0x0368(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_23D912C14C9A4893130F15B3CB799514;// 0x03B0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7925B0544410CB7D17EBFF884A78709C;// 0x03F8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D1E14C7A43FCED0FFA4781A0E86DB4D7;// 0x0440(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_95A93A5E464C680E4CE436AFC9BDF98C;// 0x0488(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A4E6630A40566C79299B19985B623726;// 0x04D0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9FE93B16484D4E30D4459D951AEA524F;// 0x0518(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9B11571D4A82D9791B9DA3812322FDD6;// 0x0560(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B99C111148D77CE4E6BB4281DF4E2E1D;// 0x05A8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4396144F417CE2FCCF13228B39D55BF5;// 0x05F0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C1E17FE74FDED08804B4F2A1F6D1A9D7;// 0x0638(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_29B902024E462AE5A7A44B8A9855F0CF;// 0x0680(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_C847EF1F45A25D94A90F3E8653F9B2D6;// 0x0730(0x0048)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0778(0x0008) MISSED OFFSET
	struct FAnimNode_Fabrik                            AnimGraphNode_Fabrik_BE646052455EFC05D442BAB12849A61D;    // 0x0780(0x0220)
	struct FAnimNode_Fabrik                            AnimGraphNode_Fabrik_D76C27624BBFC4CECC7250B32BF3AE47;    // 0x09A0(0x0220)
	struct FAnimNode_Fabrik                            AnimGraphNode_Fabrik_657C68E44ACF0ECF1BA6D0B01986D56B;    // 0x0BC0(0x0220)
	struct FAnimNode_Fabrik                            AnimGraphNode_Fabrik_74C42990462877C0A6F4BBA511DF0206;    // 0x0DE0(0x0220)
	struct FAnimNode_Fabrik                            AnimGraphNode_Fabrik_720210BF44ABE27AFFA7CDA9AF239244;    // 0x1000(0x0220)
	struct FAnimNode_Fabrik                            AnimGraphNode_Fabrik_DF8D1C0248576F80F82A4086C0D29428;    // 0x1220(0x0220)
	struct FAnimNode_Fabrik                            AnimGraphNode_Fabrik_099C7BE048951901D9E499A7B2E99BD2;    // 0x1440(0x0220)
	struct FAnimNode_Fabrik                            AnimGraphNode_Fabrik_5A01AA874B011BF0F2FE708223610090;    // 0x1660(0x0220)
	struct FAnimNode_Fabrik                            AnimGraphNode_Fabrik_9F1FA11143070C9DA4D5EEB8F6AFC278;    // 0x1880(0x0220)
	struct FAnimNode_Fabrik                            AnimGraphNode_Fabrik_4D40DD96488C3D16394EB494176FE16F;    // 0x1AA0(0x0220)
	struct FAnimNode_Fabrik                            AnimGraphNode_Fabrik_CBFC4E3C45155F7A977CB4AAC358B0B8;    // 0x1CC0(0x0220)
	struct FAnimNode_Fabrik                            AnimGraphNode_Fabrik_F64B892C42A7717C8EEAA9BFB3863474;    // 0x1EE0(0x0220)
	struct FAnimNode_Fabrik                            AnimGraphNode_Fabrik_89323228433024500C4DCD9A1472B5F2;    // 0x2100(0x0220)
	struct FAnimNode_Fabrik                            AnimGraphNode_Fabrik_A8A5C0FF49B13A7E56117BBE95FBF565;    // 0x2320(0x0220)
	struct FAnimNode_Fabrik                            AnimGraphNode_Fabrik_0C57888B4C6B57A3F69BDFBF2590CB88;    // 0x2540(0x0220)
	struct FAnimNode_Fabrik                            AnimGraphNode_Fabrik_FFF376944FA91875E5D765B0BF1254A5;    // 0x2760(0x0220)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_081748014422BF82EE8887BEC130718D;// 0x2980(0x00B0)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_6350A18F46074DB961BB6FAED769D41D;// 0x2A30(0x0048)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_A571ECE14E1DAF4FDA43598A724F7658;// 0x2A78(0x0048)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_077C5A7743DEB7592C71DF98268BB4DA;// 0x2AC0(0x00E0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_4AD43BDA48B696938885FD9E1FD835C9;// 0x2BA0(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_E4B5EC2E4B184903D7F593AC266B4DBE;// 0x2CC8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_654B58A446FC6DB901CEB3AC185840FE;// 0x2D10(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_3D95193F46103A52A6B2E88AD2FAD9A0;// 0x2DC0(0x0048)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_14F3967549503D879E11EE9ADE6EEEC5;// 0x2E08(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_7DA577DF42FFDCDD770B6FA7BB7BCB42;// 0x2EE8(0x00B0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_AEAFC47B4175A8608BF4BC88B69B8C16;// 0x2F98(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_CAAFC23C4995F3A714B6538F09157974;// 0x30C0(0x0048)
	unsigned char                                      UnknownData01[0x8];                                       // 0x3108(0x0008) MISSED OFFSET
	struct FAnimNode_Fabrik                            AnimGraphNode_Fabrik_7630025F4FB3DA61F58908B70FCBCBFF;    // 0x3110(0x0220)
	struct FAnimNode_Fabrik                            AnimGraphNode_Fabrik_1B9A3E7D4279115348614DA9015F9F47;    // 0x3330(0x0220)
	struct FAnimNode_Fabrik                            AnimGraphNode_Fabrik_C0F3DA0946EEDF9E5E2BB99D5FCFBAD1;    // 0x3550(0x0220)
	struct FAnimNode_Fabrik                            AnimGraphNode_Fabrik_3C9704574F3C6B018F9D27AD77F2A364;    // 0x3770(0x0220)
	struct FAnimNode_Fabrik                            AnimGraphNode_Fabrik_A2BBA1A047BB6D3AEE3A44BED46F6C7D;    // 0x3990(0x0220)
	struct FAnimNode_Fabrik                            AnimGraphNode_Fabrik_C57C106245CC55071DD7FC965FEC48FD;    // 0x3BB0(0x0220)
	struct FAnimNode_Fabrik                            AnimGraphNode_Fabrik_1959AEAB4B17B0658C3022BC8F110C3F;    // 0x3DD0(0x0220)
	struct FAnimNode_Fabrik                            AnimGraphNode_Fabrik_18EF2629457E43FAA764BD9CCCFED1DF;    // 0x3FF0(0x0220)
	struct FAnimNode_Fabrik                            AnimGraphNode_Fabrik_B81391194D716D20C355CF8175F5018D;    // 0x4210(0x0220)
	struct FAnimNode_Fabrik                            AnimGraphNode_Fabrik_DF47FE974D53A8FBE989E6B701CCD6F7;    // 0x4430(0x0220)
	struct FAnimNode_Fabrik                            AnimGraphNode_Fabrik_52ABF08C453A4F3883A664B6D3EB655C;    // 0x4650(0x0220)
	struct FAnimNode_Fabrik                            AnimGraphNode_Fabrik_0C8F409A479B62102A88C1BB24FD8814;    // 0x4870(0x0220)
	struct FAnimNode_Fabrik                            AnimGraphNode_Fabrik_678226A647DE0959E733079FE8AA023A;    // 0x4A90(0x0220)
	struct FAnimNode_Fabrik                            AnimGraphNode_Fabrik_61665B6D4B110F511B364BB8C5EC67E6;    // 0x4CB0(0x0220)
	struct FAnimNode_Fabrik                            AnimGraphNode_Fabrik_28CC15644D59C6FD51156C81499F0098;    // 0x4ED0(0x0220)
	struct FAnimNode_Fabrik                            AnimGraphNode_Fabrik_04167A154227ED6A57A3A5B84343AE9D;    // 0x50F0(0x0220)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_FA6C239F44DE0525A22521AFA759E597;// 0x5310(0x0048)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_827AEDCC4612C0F1DEA528BD59D48F83;// 0x5358(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_3DB6167B43CD600A393E909180B6F133;// 0x53A0(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_CB11328C46EF9AE993B8B89E9148CF95;// 0x54C8(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_D77B8FBE4D6DCC87340CB3A1965874BC;// 0x5510(0x00E0)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_C2D04EB3422B610633CDFE98EE3676D0;// 0x55F0(0x0048)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_020AE14A4C143C5CC3E8AE977F281CFB;// 0x5638(0x0048)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_ACC6CAD7465849F11D699CABB1D5E8DB;// 0x5680(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_027E7AFB41146CCC51432487CC802D1D;// 0x5760(0x00B0)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_76356627435667F8EB535FAF2BCB46F7;// 0x5810(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_FB62535E4E5F1615F06DFB8C5F0620E5;// 0x58F0(0x00B0)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_295C1AD54D8BA3070E472A9E2A5F1376;// 0x59A0(0x0160)
	float                                              Horizon;                                                  // 0x5B00(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              Vertical;                                                 // 0x5B04(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               is_swing;                                                 // 0x5B08(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               is_get;                                                   // 0x5B09(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData02[0x6];                                       // 0x5B0A(0x0006) MISSED OFFSET
	struct FScriptMulticastDelegate                    Get_Finished;                                             // 0x5B10(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable)
	struct FScriptMulticastDelegate                    Swing_Finished;                                           // 0x5B20(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable)
	float                                              move_rate;                                                // 0x5B30(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              casting_rate;                                             // 0x5B34(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               is_swing_end;                                             // 0x5B38(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               is_cast_end;                                              // 0x5B39(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData03[0x6];                                       // 0x5B3A(0x0006) MISSED OFFSET
	struct FScriptMulticastDelegate                    Swing_Release;                                            // 0x5B40(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable)
	struct FVector                                     RightHandIKLocation;                                      // 0x5B50(0x000C) (Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData)
	float                                              RightHandIKWeight;                                        // 0x5B5C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               is_casting;                                               // 0x5B60(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData04[0x3];                                       // 0x5B61(0x0003) MISSED OFFSET
	struct FVector                                     RodIKLocation;                                            // 0x5B64(0x000C) (Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData)
	float                                              RodIKRate;                                                // 0x5B70(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData05[0x4];                                       // 0x5B74(0x0004) MISSED OFFSET
	TArray<float>                                      RodIKBoneRateArray;                                       // 0x5B78(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	int                                                RodIKBoneSplitNum;                                        // 0x5B88(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              RodBendRatio;                                             // 0x5B8C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ReelPlayRate;                                             // 0x5B90(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData06[0x4];                                       // 0x5B94(0x0004) MISSED OFFSET
	class UAnimSequenceBase*                           CastSequence;                                             // 0x5B98(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              FishEscapeAnimRate;                                       // 0x5BA0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     HandOffset;                                               // 0x5BA4(0x000C) (Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData)
	class UCurveFloat*                                 HandOffsetCurve;                                          // 0x5BB0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              HandOffsetRate;                                           // 0x5BB8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AnimBlueprintGeneratedClass ABP_Fishing_re.ABP_Fishing_re_C");
		return ptr;
	}


	void SetEscapeAnimRate(float FishEscapeAnimRate);
	void EnabledCasting(bool IsFarCast);
	void Init();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Fishing_re_AnimGraphNode_Fabrik_5A01AA874B011BF0F2FE708223610090();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Fishing_re_AnimGraphNode_Fabrik_9F1FA11143070C9DA4D5EEB8F6AFC278();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Fishing_re_AnimGraphNode_Fabrik_4D40DD96488C3D16394EB494176FE16F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Fishing_re_AnimGraphNode_Fabrik_CBFC4E3C45155F7A977CB4AAC358B0B8();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Fishing_re_AnimGraphNode_Fabrik_F64B892C42A7717C8EEAA9BFB3863474();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Fishing_re_AnimGraphNode_Fabrik_89323228433024500C4DCD9A1472B5F2();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Fishing_re_AnimGraphNode_Fabrik_A8A5C0FF49B13A7E56117BBE95FBF565();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Fishing_re_AnimGraphNode_Fabrik_0C57888B4C6B57A3F69BDFBF2590CB88();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Fishing_re_AnimGraphNode_Fabrik_FFF376944FA91875E5D765B0BF1254A5();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Fishing_re_AnimGraphNode_BlendSpacePlayer_4AD43BDA48B696938885FD9E1FD835C9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Fishing_re_AnimGraphNode_Fabrik_BE646052455EFC05D442BAB12849A61D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Fishing_re_AnimGraphNode_SequencePlayer_29B902024E462AE5A7A44B8A9855F0CF();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Fishing_re_AnimGraphNode_TransitionResult_C1E17FE74FDED08804B4F2A1F6D1A9D7();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Fishing_re_AnimGraphNode_TransitionResult_4396144F417CE2FCCF13228B39D55BF5();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Fishing_re_AnimGraphNode_TransitionResult_B99C111148D77CE4E6BB4281DF4E2E1D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Fishing_re_AnimGraphNode_TransitionResult_9B11571D4A82D9791B9DA3812322FDD6();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Fishing_re_AnimGraphNode_BlendSpacePlayer_AEAFC47B4175A8608BF4BC88B69B8C16();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Fishing_re_AnimGraphNode_Fabrik_720210BF44ABE27AFFA7CDA9AF239244();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Fishing_re_AnimGraphNode_Fabrik_74C42990462877C0A6F4BBA511DF0206();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Fishing_re_AnimGraphNode_TransitionResult_9FE93B16484D4E30D4459D951AEA524F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Fishing_re_AnimGraphNode_Fabrik_7630025F4FB3DA61F58908B70FCBCBFF();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Fishing_re_AnimGraphNode_Fabrik_1B9A3E7D4279115348614DA9015F9F47();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Fishing_re_AnimGraphNode_Fabrik_C0F3DA0946EEDF9E5E2BB99D5FCFBAD1();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Fishing_re_AnimGraphNode_Fabrik_3C9704574F3C6B018F9D27AD77F2A364();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Fishing_re_AnimGraphNode_Fabrik_A2BBA1A047BB6D3AEE3A44BED46F6C7D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Fishing_re_AnimGraphNode_Fabrik_C57C106245CC55071DD7FC965FEC48FD();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Fishing_re_AnimGraphNode_Fabrik_1959AEAB4B17B0658C3022BC8F110C3F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Fishing_re_AnimGraphNode_Fabrik_18EF2629457E43FAA764BD9CCCFED1DF();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Fishing_re_AnimGraphNode_Fabrik_B81391194D716D20C355CF8175F5018D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Fishing_re_AnimGraphNode_Fabrik_DF47FE974D53A8FBE989E6B701CCD6F7();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Fishing_re_AnimGraphNode_Fabrik_52ABF08C453A4F3883A664B6D3EB655C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Fishing_re_AnimGraphNode_Fabrik_0C8F409A479B62102A88C1BB24FD8814();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Fishing_re_AnimGraphNode_Fabrik_678226A647DE0959E733079FE8AA023A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Fishing_re_AnimGraphNode_Fabrik_61665B6D4B110F511B364BB8C5EC67E6();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Fishing_re_AnimGraphNode_Fabrik_28CC15644D59C6FD51156C81499F0098();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Fishing_re_AnimGraphNode_Fabrik_04167A154227ED6A57A3A5B84343AE9D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Fishing_re_AnimGraphNode_BlendSpacePlayer_3DB6167B43CD600A393E909180B6F133();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Fishing_re_AnimGraphNode_TransitionResult_A4E6630A40566C79299B19985B623726();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Fishing_re_AnimGraphNode_TransitionResult_95A93A5E464C680E4CE436AFC9BDF98C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Fishing_re_AnimGraphNode_TransitionResult_D1E14C7A43FCED0FFA4781A0E86DB4D7();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Fishing_re_AnimGraphNode_TransitionResult_7925B0544410CB7D17EBFF884A78709C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Fishing_re_AnimGraphNode_Fabrik_657C68E44ACF0ECF1BA6D0B01986D56B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Fishing_re_AnimGraphNode_TransitionResult_23D912C14C9A4893130F15B3CB799514();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Fishing_re_AnimGraphNode_LayeredBoneBlend_ACC6CAD7465849F11D699CABB1D5E8DB();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Fishing_re_AnimGraphNode_LayeredBoneBlend_76356627435667F8EB535FAF2BCB46F7();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Fishing_re_AnimGraphNode_ModifyBone_295C1AD54D8BA3070E472A9E2A5F1376();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Fishing_re_AnimGraphNode_Fabrik_D76C27624BBFC4CECC7250B32BF3AE47();
	void BlueprintUpdateAnimation(float* DeltaTimeX);
	void AnimNotify_MG_Fishing_Get_End();
	void AnimNotify_MG_Fishing_Swing_After_End();
	void AnimNotify_MG_Fishing_Cast_End();
	void AnimNotify_MG_Fishing_Cast_Release();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Fishing_re_AnimGraphNode_Fabrik_099C7BE048951901D9E499A7B2E99BD2();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Fishing_re_AnimGraphNode_Fabrik_DF8D1C0248576F80F82A4086C0D29428();
	void ExecuteUbergraph_ABP_Fishing_re(int EntryPoint);
	void Swing_Release__DelegateSignature();
	void Swing_Finished__DelegateSignature();
	void Get_Finished__DelegateSignature();
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
