#pragma once

// Name: Shenmue3, Version: 1.0.2

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass ABP_AR_Toad.ABP_AR_Toad_C
// 0x0EE9 (0x1249 - 0x0360)
class UABP_AR_Toad_C : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                           // 0x0360(0x0008) (Transient, DuplicateTransient)
	struct FAnimNode_Root                              AnimGraphNode_Root_2C2B8F0142F45D71729BA5B1150CFD96;      // 0x0368(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3D3A628241F1D58DFBFA34ADEC039155;// 0x03B0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F321AAD8442AF73C5A1C5D90EDD7FD9D;// 0x03F8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3430093E4ACD755369E80FA040441B22;// 0x0440(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5C9DCF83444019EA94C8738CEB44F9DE;// 0x0488(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_13F8459147F0BF03D4B92C91185DFA71;// 0x04D0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FF79132749180BE2F6859B91C8664787;// 0x0518(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B107511F4289EC89F79643952C815010;// 0x0560(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D47E434F4CA145B4A2EE76B04D90CF46;// 0x05A8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8BF005F643A26396E28026BBAF826D81;// 0x05F0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DC6BA0154CDFED4E808DF59F433FC686;// 0x0638(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6ED2B271497CC2A12D597C8BFB1965C6;// 0x0680(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7C8A0973475BF65C6339E8B2DB422394;// 0x06C8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D8241AF043033B8084642C8CC882319D;// 0x0710(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3A0B4F864C9D73BD8BA1C3959FB52086;// 0x0758(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_23C34F4740062CADCF645CBC36341608;// 0x07A0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0DAADE244C59A6B01766E2B380B46944;// 0x07E8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_58C88E254ADC7C357AC6E59423E25450;// 0x0830(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6A84D07D430B50FCB9C6D5B61308344B;// 0x0878(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A67FC9CF4BA0BDC138B9029181EC40CA;// 0x08C0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2C57EED64B70BA93CF9681A53B5A7138;// 0x0908(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3C9E286749CB380CC551DDB1C0E9C8D3;// 0x0950(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_304EE9B546BF61ABB23D8C80D57B93D8;// 0x0998(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B93D175141CA0C0179741EBDB3CF6B04;// 0x09E0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_26E9A9F7426829DFC37EECB323AEF5B2;// 0x0A28(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3C83A30D4DF3980518A1AE9E115ED53E;// 0x0A70(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5FCE87A443B1F27A6CCE9BA6749B9336;// 0x0AB8(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_1E4DBAB3476192184A65B4A00A9159EE;// 0x0B68(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_56B9EE2A4D69A7FB9940F1819152838A;// 0x0BB0(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_63806BE84B55057EBF024C88A2D1C7D5;// 0x0C60(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_36A4DB8E44AEF068ED3064AF3DDBF4D0;// 0x0CA8(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_7DAE0C0648395CF86C9EB095D900F3DF;// 0x0D58(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_64A0C895447513E2C3E3B5AC9B2E6839;// 0x0DA0(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_E184668340D857D0D1FFFA847805F61A;// 0x0E50(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_EE0E6B014E1598F24B2F749B7FE3FC84;// 0x0E98(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_52C83ACB4290B41F9DAE73A07BA90E6E;// 0x0F48(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_091FBA48422F745B88770E9A021F6F24;// 0x0F90(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_67333B0149F74D9411E604AB64C4E7F6;// 0x1040(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_D0FC7E98446F6526912CB5984B5D4FF3;// 0x1088(0x00E0)
	float                                              side_rate;                                                // 0x1168(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              walk_rate;                                                // 0x116C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               is_death_anim_end;                                        // 0x1170(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               is_death;                                                 // 0x1171(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TEnumAsByte<E_AR_Motion_Type>                      mot_type;                                                 // 0x1172(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x5];                                       // 0x1173(0x0005) MISSED OFFSET
	struct FScriptMulticastDelegate                    IdleAnimEnd;                                              // 0x1178(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable)
	struct FScriptMulticastDelegate                    WaitAnimEnd;                                              // 0x1188(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable)
	struct FScriptMulticastDelegate                    WalkAnimEnd;                                              // 0x1198(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable)
	struct FScriptMulticastDelegate                    JumpAnimEnd;                                              // 0x11A8(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable)
	struct FScriptMulticastDelegate                    Jump2AnimEnd;                                             // 0x11B8(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable)
	struct FScriptMulticastDelegate                    MoveZero;                                                 // 0x11C8(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable)
	struct FScriptMulticastDelegate                    MaxJump;                                                  // 0x11D8(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable)
	struct FScriptMulticastDelegate                    JumpStart;                                                // 0x11E8(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable)
	bool                                               is_walk_st_end;                                           // 0x11F8(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x11F9(0x0007) MISSED OFFSET
	struct FScriptMulticastDelegate                    WalkMoveStart;                                            // 0x1200(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable)
	struct FScriptMulticastDelegate                    WalkStEnd;                                                // 0x1210(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable)
	struct FScriptMulticastDelegate                    WalkSETiming;                                             // 0x1220(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable)
	struct FScriptMulticastDelegate                    CrySETiming;                                              // 0x1230(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable)
	bool                                               is_jump;                                                  // 0x1240(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData02[0x3];                                       // 0x1241(0x0003) MISSED OFFSET
	float                                              DelayAnimStartPos;                                        // 0x1244(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               IsInRace;                                                 // 0x1248(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AnimBlueprintGeneratedClass ABP_AR_Toad.ABP_AR_Toad_C");
		return ptr;
	}


	void SetIsInRaceFlag(bool IsInRace);
	void setDelayAnimStartPos(float StartPos);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AR_Toad_AnimGraphNode_TransitionResult_8BF005F643A26396E28026BBAF826D81();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AR_Toad_AnimGraphNode_TransitionResult_D47E434F4CA145B4A2EE76B04D90CF46();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AR_Toad_AnimGraphNode_TransitionResult_DC6BA0154CDFED4E808DF59F433FC686();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AR_Toad_AnimGraphNode_TransitionResult_6ED2B271497CC2A12D597C8BFB1965C6();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AR_Toad_AnimGraphNode_TransitionResult_7C8A0973475BF65C6339E8B2DB422394();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AR_Toad_AnimGraphNode_TransitionResult_D8241AF043033B8084642C8CC882319D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AR_Toad_AnimGraphNode_TransitionResult_B107511F4289EC89F79643952C815010();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AR_Toad_AnimGraphNode_TransitionResult_3A0B4F864C9D73BD8BA1C3959FB52086();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AR_Toad_AnimGraphNode_TransitionResult_23C34F4740062CADCF645CBC36341608();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AR_Toad_AnimGraphNode_TransitionResult_0DAADE244C59A6B01766E2B380B46944();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AR_Toad_AnimGraphNode_TransitionResult_58C88E254ADC7C357AC6E59423E25450();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AR_Toad_AnimGraphNode_TransitionResult_FF79132749180BE2F6859B91C8664787();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AR_Toad_AnimGraphNode_TransitionResult_6A84D07D430B50FCB9C6D5B61308344B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AR_Toad_AnimGraphNode_TransitionResult_A67FC9CF4BA0BDC138B9029181EC40CA();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AR_Toad_AnimGraphNode_TransitionResult_2C57EED64B70BA93CF9681A53B5A7138();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AR_Toad_AnimGraphNode_TransitionResult_3C9E286749CB380CC551DDB1C0E9C8D3();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AR_Toad_AnimGraphNode_TransitionResult_13F8459147F0BF03D4B92C91185DFA71();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AR_Toad_AnimGraphNode_TransitionResult_304EE9B546BF61ABB23D8C80D57B93D8();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AR_Toad_AnimGraphNode_TransitionResult_B93D175141CA0C0179741EBDB3CF6B04();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AR_Toad_AnimGraphNode_TransitionResult_26E9A9F7426829DFC37EECB323AEF5B2();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AR_Toad_AnimGraphNode_TransitionResult_3C83A30D4DF3980518A1AE9E115ED53E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AR_Toad_AnimGraphNode_TransitionResult_5C9DCF83444019EA94C8738CEB44F9DE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AR_Toad_AnimGraphNode_SequencePlayer_5FCE87A443B1F27A6CCE9BA6749B9336();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AR_Toad_AnimGraphNode_TransitionResult_3430093E4ACD755369E80FA040441B22();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AR_Toad_AnimGraphNode_SequencePlayer_091FBA48422F745B88770E9A021F6F24();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AR_Toad_AnimGraphNode_TransitionResult_3D3A628241F1D58DFBFA34ADEC039155();
	void AnimNotify_Toad_Dead_Anim_End();
	void AnimNotify_Toad_Walk_Anim_End();
	void AnimNotify_Toad_Jump_Anim_End();
	void AnimNotify_Toad_Idle_Anim_End();
	void AnimNotify_Toad_Move_Zero();
	void AnimNotify_Toad_Max_Jump();
	void AnimNotify_Toad_Jump_Start();
	void AnimNotify_Toad_Walk_st_end();
	void AnimNotify_Toad_Walk_st_move_start();
	void AnimNotify_MG_WalkTiming();
	void AnimNotify_MG_CryTiming();
	void ExecuteUbergraph_ABP_AR_Toad(int EntryPoint);
	void CrySETiming__DelegateSignature();
	void WalkSETiming__DelegateSignature();
	void WalkStEnd__DelegateSignature();
	void WalkMoveStart__DelegateSignature();
	void JumpStart__DelegateSignature();
	void MaxJump__DelegateSignature();
	void MoveZero__DelegateSignature();
	void Jump2AnimEnd__DelegateSignature();
	void JumpAnimEnd__DelegateSignature();
	void WalkAnimEnd__DelegateSignature();
	void WaitAnimEnd__DelegateSignature();
	void IdleAnimEnd__DelegateSignature();
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
