#pragma once

// Name: Shenmue3SDK, Version: 1.4.1

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass ABP_MiniGame_CJ_RyoBS.ABP_MiniGame_CJ_RyoBS_C
// 0x1FAC (0x230C - 0x0360)
class UABP_MiniGame_CJ_RyoBS_C : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                           // 0x0360(0x0008) (Transient, DuplicateTransient)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B3CEA584409E41D625FEEE9E79C433BF;// 0x0368(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8EE9B44945A828DC68377C9528B09A30;// 0x03B0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_15509F5C4EB95B3F167242BD21CBABE6;// 0x03F8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_002C74864BBEAAA60D8E7D84FB16CD79;// 0x0440(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_EF042FF5468FA790780E2AA2973E114C;// 0x0488(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8BD841FB4C0ADB37FC30B08426EFA43B;// 0x04D0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8B8F3F6442774632840BE78E0A2D65FB;// 0x0518(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_01B1D6954BCCAB6BD4CC468B0E775FEC;// 0x0560(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_347AFBD54B888F40FD10C28F61039030;// 0x05A8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_ED0C88CD4C0D88F20016FDB49ECB57F8;// 0x05F0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A39F82EC493C5BBD66CB69A0972E2E7F;// 0x0638(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_950E75EB4295C6F319F0CEAE367E33E5;// 0x0680(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_BD01B02C45F9E40A7684EEBA703ECD55;// 0x06C8(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_19C9D89D4B71E047E28528B524E4814C;// 0x0778(0x0048)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_FDB335A6407A9F01042F509CF0B8F237;// 0x07C0(0x0048)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_C800834B49F94F56E50BD18797EC9252;// 0x0808(0x0048)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_57F8A3BF4397E3C13E3DC3966E22C211;// 0x0850(0x0160)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_CAC8ACD24B385331CD6F6EB1AB387DCE;// 0x09B0(0x0160)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_534D9C0B4290EFE03DA2E4B9BC3F884C;// 0x0B10(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_82EE55BF4100AD6E56539790E291BDEB;// 0x0C38(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B190065F49C1C8026D296D92260ADEDA;// 0x0C80(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_051F2E70463FCFDC65A50EB74C36D80D;// 0x0D30(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_2AD14E2649AA531E5A285C9C53048AE4;// 0x0D78(0x0128)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_690274E0488D14D2390764AEEC5F1306;// 0x0EA0(0x0120)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_7874036242B3954B15A0F585EE8CF31E;// 0x0FC0(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_E042C10C4691A7E7A61F3C9BE7A1BAC4;// 0x10E8(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_D080595E474B2FE05E0BBABB83CACADF;// 0x1130(0x0128)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_BBD4C12E4BB553DC3E318DA7CFAE9515;// 0x1258(0x0160)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_D18D0E274E09F1D92EBB999DF0B3A6A1;// 0x13B8(0x0048)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_41DFC6154EDEB4CA5FAAA7A18D2B6362;// 0x1400(0x0048)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_7A8A6A30431B9A4E51110B9E9ABC3759;// 0x1448(0x0160)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_388765FC40E480FA2380A0B02DFBD8F7;// 0x15A8(0x0160)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_08B8A8C140AA36A42904F1A712A629ED;// 0x1708(0x0160)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_8BF061F8475F5506098B73B9B4B363CD;// 0x1868(0x0048)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_C6D6E66D478CCCE0D070509B7725EBA0;// 0x18B0(0x0048)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_F0B0B0394528D34D5D148F8BFB40B6FA;// 0x18F8(0x0048)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_A88FFD734A1B194A87D498B4E5841E65;// 0x1940(0x0160)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_B3B5B1C241AF1B3AE1493EBFA0043FA5;// 0x1AA0(0x0160)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_235C47CF46A8C51BC82DFFAF60B48727;// 0x1C00(0x0160)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_32AF07F84B83C8487F174686B8E2F2CE;// 0x1D60(0x0160)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_7660B0BF4B09B60D88992B9AF017A950;// 0x1EC0(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_F213260B493D1F49DB9713946BAA391C;// 0x1FE8(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_29FBCAFF4D7729F9ECE38C9B83048B94;// 0x2030(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_C6187B60465627669D2E46892FC71C11;// 0x2158(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_7EEF5CC6485C744425CA3E833809AC55;// 0x21A0(0x00E0)
	struct FAnimNode_Root                              AnimGraphNode_Root_F00E173E46299DE81C045FABD613D7D0;      // 0x2280(0x0048)
	bool                                               bDrop;                                                    // 0x22C8(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bThrowIdle;                                               // 0x22C9(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bThrow;                                                   // 0x22CA(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bRelease;                                                 // 0x22CB(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bIdle;                                                    // 0x22CC(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x22CD(0x0003) MISSED OFFSET
	struct FVector                                     TargetWorldPos;                                           // 0x22D0(0x000C) (Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData)
	float                                              Pos_LR;                                                   // 0x22DC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              Pos_FMH;                                                  // 0x22E0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ReleaseBlend;                                             // 0x22E4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TEnumAsByte<EN_CJ_PlayerStatus>                    State;                                                    // 0x22E8(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x22E9(0x0003) MISSED OFFSET
	struct FRotator                                    KnobRotation;                                             // 0x22EC(0x000C) (Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData)
	float                                              MiddleFingerCorrection;                                   // 0x22F8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MiddleFingerBlendAlpha;                                   // 0x22FC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FRotator                                    KnobRotationBack;                                         // 0x2300(0x000C) (Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AnimBlueprintGeneratedClass ABP_MiniGame_CJ_RyoBS.ABP_MiniGame_CJ_RyoBS_C");
		return ptr;
	}


	void SetFingerParameta(const struct FRotator& KnobRotation, float MfingerCorrection);
	void SetState(TEnumAsByte<EN_CJ_PlayerStatus> Set_State);
	void TEST(bool* newParam);
	void SetIKTarget(const struct FVector& Target);
	void ResetFlag();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MiniGame_CJ_RyoBS_AnimGraphNode_TransitionResult_950E75EB4295C6F319F0CEAE367E33E5();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MiniGame_CJ_RyoBS_AnimGraphNode_TransitionResult_ED0C88CD4C0D88F20016FDB49ECB57F8();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MiniGame_CJ_RyoBS_AnimGraphNode_ModifyBone_57F8A3BF4397E3C13E3DC3966E22C211();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MiniGame_CJ_RyoBS_AnimGraphNode_ModifyBone_CAC8ACD24B385331CD6F6EB1AB387DCE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MiniGame_CJ_RyoBS_AnimGraphNode_BlendSpacePlayer_534D9C0B4290EFE03DA2E4B9BC3F884C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MiniGame_CJ_RyoBS_AnimGraphNode_TransitionResult_347AFBD54B888F40FD10C28F61039030();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MiniGame_CJ_RyoBS_AnimGraphNode_TransitionResult_01B1D6954BCCAB6BD4CC468B0E775FEC();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MiniGame_CJ_RyoBS_AnimGraphNode_BlendSpacePlayer_2AD14E2649AA531E5A285C9C53048AE4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MiniGame_CJ_RyoBS_AnimGraphNode_TwoWayBlend_690274E0488D14D2390764AEEC5F1306();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MiniGame_CJ_RyoBS_AnimGraphNode_BlendSpacePlayer_7874036242B3954B15A0F585EE8CF31E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MiniGame_CJ_RyoBS_AnimGraphNode_TransitionResult_8B8F3F6442774632840BE78E0A2D65FB();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MiniGame_CJ_RyoBS_AnimGraphNode_BlendSpacePlayer_D080595E474B2FE05E0BBABB83CACADF();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MiniGame_CJ_RyoBS_AnimGraphNode_ModifyBone_BBD4C12E4BB553DC3E318DA7CFAE9515();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MiniGame_CJ_RyoBS_AnimGraphNode_ModifyBone_7A8A6A30431B9A4E51110B9E9ABC3759();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MiniGame_CJ_RyoBS_AnimGraphNode_ModifyBone_388765FC40E480FA2380A0B02DFBD8F7();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MiniGame_CJ_RyoBS_AnimGraphNode_ModifyBone_08B8A8C140AA36A42904F1A712A629ED();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MiniGame_CJ_RyoBS_AnimGraphNode_TransitionResult_8BD841FB4C0ADB37FC30B08426EFA43B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MiniGame_CJ_RyoBS_AnimGraphNode_TransitionResult_A39F82EC493C5BBD66CB69A0972E2E7F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MiniGame_CJ_RyoBS_AnimGraphNode_TransitionResult_EF042FF5468FA790780E2AA2973E114C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MiniGame_CJ_RyoBS_AnimGraphNode_TransitionResult_002C74864BBEAAA60D8E7D84FB16CD79();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MiniGame_CJ_RyoBS_AnimGraphNode_ModifyBone_A88FFD734A1B194A87D498B4E5841E65();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MiniGame_CJ_RyoBS_AnimGraphNode_ModifyBone_B3B5B1C241AF1B3AE1493EBFA0043FA5();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MiniGame_CJ_RyoBS_AnimGraphNode_ModifyBone_235C47CF46A8C51BC82DFFAF60B48727();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MiniGame_CJ_RyoBS_AnimGraphNode_ModifyBone_32AF07F84B83C8487F174686B8E2F2CE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MiniGame_CJ_RyoBS_AnimGraphNode_BlendSpacePlayer_7660B0BF4B09B60D88992B9AF017A950();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MiniGame_CJ_RyoBS_AnimGraphNode_TransitionResult_15509F5C4EB95B3F167242BD21CBABE6();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MiniGame_CJ_RyoBS_AnimGraphNode_TransitionResult_8EE9B44945A828DC68377C9528B09A30();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MiniGame_CJ_RyoBS_AnimGraphNode_BlendSpacePlayer_29FBCAFF4D7729F9ECE38C9B83048B94();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MiniGame_CJ_RyoBS_AnimGraphNode_TransitionResult_B3CEA584409E41D625FEEE9E79C433BF();
	void AnimNotify_MG_KF_ReleaseStart();
	void AnimNotify_MG_KF_ReleaseEnd();
	void AnimNotify_TransThrowStart();
	void ExecuteUbergraph_ABP_MiniGame_CJ_RyoBS(int EntryPoint);
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
