#pragma once

// Name: Shenmue3, Version: 1.0.2

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// Class Shenmue3.TalkEventTaskBase
// 0x0038 (0x0060 - 0x0028)
class UTalkEventTaskBase : public UObject
{
public:
	int                                                Index;                                                    // 0x0028(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int                                                ExcelIndex;                                               // 0x002C(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x11];                                      // 0x0030(0x0011) MISSED OFFSET
	bool                                               bFinishedTask;                                            // 0x0041(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               isCanSkipTask;                                            // 0x0042(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData01[0x5];                                       // 0x0043(0x0005) MISSED OFFSET
	struct FString                                     ExternalScriptName;                                       // 0x0048(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	class UTalkEventProcessBase*                       TalkProcess;                                              // 0x0058(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Shenmue3.TalkEventTaskBase");
		return ptr;
	}


	bool Update(float DeltaTime);
	bool IsStopForceDebugSkip(class AS3TalkEventManagerBase* mng);
	struct FString GetLogMessage();
	struct FString GetCommandName();
	void Finish();
	void FinalizeTask();
};


// Class Shenmue3.AcCameraTask
// 0x0028 (0x0088 - 0x0060)
class UAcCameraTask : public UTalkEventTaskBase
{
public:
	unsigned char                                      UnknownData00[0x28];                                      // 0x0060(0x0028) UNKNOWN PROPERTY: SoftObjectProperty Shenmue3.AcCameraTask.SequenserName

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Shenmue3.AcCameraTask");
		return ptr;
	}

};


// Class Shenmue3.AcTask
// 0x0000 (0x0060 - 0x0060)
class UAcTask : public UTalkEventTaskBase
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Shenmue3.AcTask");
		return ptr;
	}

};


// Class Shenmue3.BattleTask
// 0x0040 (0x00A0 - 0x0060)
class UBattleTask : public UTalkEventTaskBase
{
public:
	struct FString                                     BattleId;                                                 // 0x0060(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	struct FString                                     WinLabelName;                                             // 0x0070(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	int                                                WinLabelIndex;                                            // 0x0080(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0084(0x0004) MISSED OFFSET
	struct FString                                     LoseLabelName;                                            // 0x0088(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	int                                                LoseLabelIndex;                                           // 0x0098(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                NextLabelIndex;                                           // 0x009C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Shenmue3.BattleTask");
		return ptr;
	}


	void SetWinLabelIndex();
	void SetLoseLabelIndex();
};


// Class Shenmue3.BetTask
// 0x0050 (0x00B0 - 0x0060)
class UBetTask : public UTalkEventTaskBase
{
public:
	int                                                JumpLabelIndexBet;                                        // 0x0060(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                JumpLabelIndexCancel;                                     // 0x0064(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                JumpLabelIndexEnoughMoney;                                // 0x0068(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x006C(0x0004) MISSED OFFSET
	struct FString                                     JumpLabelBet;                                             // 0x0070(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	struct FString                                     JumpLabelCancel;                                          // 0x0080(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	struct FString                                     JumpLabelEnoughMoney;                                     // 0x0090(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	int                                                OverrideBet;                                              // 0x00A0(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                OverrideMaxPlayCount;                                     // 0x00A4(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData01[0x8];                                       // 0x00A8(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Shenmue3.BetTask");
		return ptr;
	}


	void NextSelectEnoughMoney();
	void NextSelectCancel();
	void NextSelectBet();
};


// Class Shenmue3.BreakTask
// 0x0000 (0x0060 - 0x0060)
class UBreakTask : public UTalkEventTaskBase
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Shenmue3.BreakTask");
		return ptr;
	}

};


// Class Shenmue3.BuyKihudaTask
// 0x0030 (0x0090 - 0x0060)
class UBuyKihudaTask : public UTalkEventTaskBase
{
public:
	struct FString                                     StickerBuyLabelName;                                      // 0x0060(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	int                                                StickerBuyLabelIndex;                                     // 0x0070(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0074(0x0004) MISSED OFFSET
	struct FString                                     StickerCancelLabelName;                                   // 0x0078(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	int                                                StickerCancelLabelIndex;                                  // 0x0088(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                NextLabelIndex;                                           // 0x008C(0x0004) (Edit, ZeroConstructor, EditConst, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Shenmue3.BuyKihudaTask");
		return ptr;
	}


	void SetNextCancelLabel();
	void SetNextBuyLabel();
};


// Class Shenmue3.AcEndTask
// 0x0000 (0x0060 - 0x0060)
class UAcEndTask : public UTalkEventTaskBase
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Shenmue3.AcEndTask");
		return ptr;
	}

};


// Class Shenmue3.CallScriptTask
// 0x0010 (0x0070 - 0x0060)
class UCallScriptTask : public UTalkEventTaskBase
{
public:
	struct FString                                     AssetPath;                                                // 0x0060(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Shenmue3.CallScriptTask");
		return ptr;
	}


	struct FString GetScriptName();
};


// Class Shenmue3.CameraGroupTask
// 0x0020 (0x0080 - 0x0060)
class UCameraGroupTask : public UTalkEventTaskBase
{
public:
	struct FString                                     Group;                                                    // 0x0060(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	TArray<struct FString>                             TargetCharacterIDs;                                       // 0x0070(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Shenmue3.CameraGroupTask");
		return ptr;
	}

};


// Class Shenmue3.CameraTask
// 0x0020 (0x0080 - 0x0060)
class UCameraTask : public UTalkEventTaskBase
{
public:
	struct FString                                     CameraName;                                               // 0x0060(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	TArray<struct FString>                             TargetCharacterIDs;                                       // 0x0070(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Shenmue3.CameraTask");
		return ptr;
	}

};


// Class Shenmue3.CameraActorTask
// 0x0010 (0x0070 - 0x0060)
class UCameraActorTask : public UTalkEventTaskBase
{
public:
	struct FString                                     TargetCharacterID;                                        // 0x0060(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Shenmue3.CameraActorTask");
		return ptr;
	}

};


// Class Shenmue3.TalkTask
// 0x0048 (0x00A8 - 0x0060)
class UTalkTask : public UTalkEventTaskBase
{
public:
	struct FString                                     TalkCharacterId;                                          // 0x0060(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	struct FString                                     LockTargetCharacterId;                                    // 0x0070(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	struct FString                                     EmoteType;                                                // 0x0080(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	bool                                               bCameraChangeFlag;                                        // 0x0090(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	bool                                               bNoVoiceFlag;                                             // 0x0091(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData00[0x6];                                       // 0x0092(0x0006) MISSED OFFSET
	struct FString                                     MessageLabel;                                             // 0x0098(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Shenmue3.TalkTask");
		return ptr;
	}

};


// Class Shenmue3.ByeTask
// 0x0000 (0x00A8 - 0x00A8)
class UByeTask : public UTalkTask
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Shenmue3.ByeTask");
		return ptr;
	}

};


// Class Shenmue3.CanMiniGameFlagTask
// 0x0018 (0x0078 - 0x0060)
class UCanMiniGameFlagTask : public UTalkEventTaskBase
{
public:
	bool                                               bCanFlag;                                                 // 0x0060(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0061(0x0007) MISSED OFFSET
	struct FString                                     TargetCharacterID;                                        // 0x0068(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Shenmue3.CanMiniGameFlagTask");
		return ptr;
	}

};


// Class Shenmue3.BattleResultTask
// 0x0008 (0x0068 - 0x0060)
class UBattleResultTask : public UTalkEventTaskBase
{
public:
	int                                                Result;                                                   // 0x0060(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0064(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Shenmue3.BattleResultTask");
		return ptr;
	}

};


// Class Shenmue3.ChangeClothesTask
// 0x0010 (0x0070 - 0x0060)
class UChangeClothesTask : public UTalkEventTaskBase
{
public:
	struct FName                                       CharacterID;                                              // 0x0060(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	struct FName                                       ClothesId;                                                // 0x0068(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Shenmue3.ChangeClothesTask");
		return ptr;
	}

};


// Class Shenmue3.ChangeFocusTask
// 0x0020 (0x0080 - 0x0060)
class UChangeFocusTask : public UTalkEventTaskBase
{
public:
	TArray<struct FString>                             TargetActorID;                                            // 0x0060(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	float                                              Time;                                                     // 0x0070(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	float                                              DelayTime;                                                // 0x0074(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0078(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Shenmue3.ChangeFocusTask");
		return ptr;
	}

};


// Class Shenmue3.CharacterTurnTask
// 0x0028 (0x0088 - 0x0060)
class UCharacterTurnTask : public UTalkEventTaskBase
{
public:
	struct FString                                     TurnCharacterId;                                          // 0x0060(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	struct FString                                     LookAtCharacterId;                                        // 0x0070(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	float                                              DelayTime;                                                // 0x0080(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	float                                              RotationTime;                                             // 0x0084(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Shenmue3.CharacterTurnTask");
		return ptr;
	}

};


// Class Shenmue3.CharaGroupTask
// 0x0010 (0x0070 - 0x0060)
class UCharaGroupTask : public UTalkEventTaskBase
{
public:
	TArray<struct FString>                             JoinThisTalkActorIDs;                                     // 0x0060(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Shenmue3.CharaGroupTask");
		return ptr;
	}

};


// Class Shenmue3.ChooseMiniGameTask
// 0x0038 (0x0098 - 0x0060)
class UChooseMiniGameTask : public UTalkEventTaskBase
{
public:
	struct FString                                     ChooseLabelName;                                          // 0x0060(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	int                                                ChooseLabelIndex;                                         // 0x0070(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0074(0x0004) MISSED OFFSET
	struct FString                                     CancelLabelName;                                          // 0x0078(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	int                                                CancelLabelIndex;                                         // 0x0088(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                NextLabelIndex;                                           // 0x008C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	bool                                               bManualCamera;                                            // 0x0090(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0091(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Shenmue3.ChooseMiniGameTask");
		return ptr;
	}


	void NextSelectChoose();
	void NextSelectCancel();
};


// Class Shenmue3.ControlCameraTask
// 0x0028 (0x0088 - 0x0060)
class UControlCameraTask : public UTalkEventTaskBase
{
public:
	struct FString                                     CameraName;                                               // 0x0060(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	int                                                CameraDistance;                                           // 0x0070(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                StartFrame;                                               // 0x0074(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	TArray<struct FString>                             TargetCharacterIDs;                                       // 0x0078(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Shenmue3.ControlCameraTask");
		return ptr;
	}

};


// Class Shenmue3.DevExtendedTask
// 0x0008 (0x0068 - 0x0060)
class UDevExtendedTask : public UTalkEventTaskBase
{
public:
	int                                                NewStep;                                                  // 0x0060(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0064(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Shenmue3.DevExtendedTask");
		return ptr;
	}

};


// Class Shenmue3.DialogTask
// 0x0040 (0x00A0 - 0x0060)
class UDialogTask : public UTalkEventTaskBase
{
public:
	struct FString                                     DialogId;                                                 // 0x0060(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	bool                                               bSelectDecide;                                            // 0x0070(0x0001) (Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0071(0x0007) MISSED OFFSET
	struct FString                                     DecideLabel;                                              // 0x0078(0x0010) (ZeroConstructor)
	struct FString                                     CancelLabel;                                              // 0x0088(0x0010) (ZeroConstructor)
	int                                                DecideIndex;                                              // 0x0098(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                CancelIndex;                                              // 0x009C(0x0004) (ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Shenmue3.DialogTask");
		return ptr;
	}

};


// Class Shenmue3.EmoteTask
// 0x0028 (0x0088 - 0x0060)
class UEmoteTask : public UTalkEventTaskBase
{
public:
	struct FString                                     CharacterID;                                              // 0x0060(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	struct FString                                     EmoteType;                                                // 0x0070(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	float                                              DelayTime;                                                // 0x0080(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0084(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Shenmue3.EmoteTask");
		return ptr;
	}

};


// Class Shenmue3.DojoCaptionTask
// 0x0010 (0x0070 - 0x0060)
class UDojoCaptionTask : public UTalkEventTaskBase
{
public:
	struct FName                                       CaptionId;                                                // 0x0060(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	bool                                               bStartFlag;                                               // 0x0068(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0069(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Shenmue3.DojoCaptionTask");
		return ptr;
	}

};


// Class Shenmue3.EnterMiniGameTask
// 0x0010 (0x0070 - 0x0060)
class UEnterMiniGameTask : public UTalkEventTaskBase
{
public:
	float                                              WaitTime;                                                 // 0x0060(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                WaitFrame;                                                // 0x0064(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0068(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Shenmue3.EnterMiniGameTask");
		return ptr;
	}

};


// Class Shenmue3.EnableDetectIcon
// 0x0008 (0x0068 - 0x0060)
class UEnableDetectIcon : public UTalkEventTaskBase
{
public:
	bool                                               isTalk;                                                   // 0x0060(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	bool                                               isMemo;                                                   // 0x0061(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	bool                                               isMenu;                                                   // 0x0062(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData00[0x5];                                       // 0x0063(0x0005) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Shenmue3.EnableDetectIcon");
		return ptr;
	}

};


// Class Shenmue3.EventMiniGameTask
// 0x0028 (0x0088 - 0x0060)
class UEventMiniGameTask : public UTalkEventTaskBase
{
public:
	TArray<struct FEventJumpLabel>                     EventJumpLabels;                                          // 0x0060(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	TArray<int>                                        LabelIndex;                                               // 0x0070(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0080(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Shenmue3.EventMiniGameTask");
		return ptr;
	}


	void SetNextLabelIndex(int NextIndex);
	bool IsSetupLabelIndex(int CheckIndex);
};


// Class Shenmue3.ScriptEventTriggerBase
// 0x0000 (0x0028 - 0x0028)
class UScriptEventTriggerBase : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Shenmue3.ScriptEventTriggerBase");
		return ptr;
	}

};


// Class Shenmue3.FlagTrigger
// 0x0010 (0x0038 - 0x0028)
class UFlagTrigger : public UScriptEventTriggerBase
{
public:
	int                                                Index;                                                    // 0x0028(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                MinValue;                                                 // 0x002C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                MaxValue;                                                 // 0x0030(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0034(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Shenmue3.FlagTrigger");
		return ptr;
	}

};


// Class Shenmue3.FadeTask
// 0x0010 (0x0070 - 0x0060)
class UFadeTask : public UTalkEventTaskBase
{
public:
	int                                                FadeType;                                                 // 0x0060(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	float                                              FadeTime;                                                 // 0x0064(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                FadeWaitForProcessing;                                    // 0x0068(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                FadeColorNum;                                             // 0x006C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Shenmue3.FadeTask");
		return ptr;
	}

};


// Class Shenmue3.GameTimeTask
// 0x0008 (0x0068 - 0x0060)
class UGameTimeTask : public UTalkEventTaskBase
{
public:
	float                                              GameTime;                                                 // 0x0060(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                Sign;                                                     // 0x0064(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Shenmue3.GameTimeTask");
		return ptr;
	}

};


// Class Shenmue3.GachaFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UGachaFunctionLibrary : public UBlueprintFunctionLibrary
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Shenmue3.GachaFunctionLibrary");
		return ptr;
	}


	void SetGachaDataTable(class UDataTable* GachaItemTable);
	bool PlayGacha(const struct FName& GachaId, struct FS3GachaItem* Out, bool* IsRare);
	void LoadGachaDataTable(const struct FString& GachaItemTableName);
	bool IsLoadGachaDataTable();
};


// Class Shenmue3.GiftMiniGameTask
// 0x0000 (0x0060 - 0x0060)
class UGiftMiniGameTask : public UTalkEventTaskBase
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Shenmue3.GiftMiniGameTask");
		return ptr;
	}

};


// Class Shenmue3.GotoTask
// 0x0018 (0x0078 - 0x0060)
class UGotoTask : public UTalkEventTaskBase
{
public:
	struct FString                                     labelName;                                                // 0x0060(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	int                                                GotoIndex;                                                // 0x0070(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0074(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Shenmue3.GotoTask");
		return ptr;
	}

};


// Class Shenmue3.HelloTask
// 0x0000 (0x00A8 - 0x00A8)
class UHelloTask : public UTalkTask
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Shenmue3.HelloTask");
		return ptr;
	}

};


// Class Shenmue3.HelpTask
// 0x0018 (0x0078 - 0x0060)
class UHelpTask : public UTalkEventTaskBase
{
public:
	struct FString                                     HelpId;                                                   // 0x0060(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	bool                                               bFirstOnly;                                               // 0x0070(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0071(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Shenmue3.HelpTask");
		return ptr;
	}

};


// Class Shenmue3.HintTalkData
// 0x0050 (0x0078 - 0x0028)
class UHintTalkData : public UObject
{
public:
	TMap<struct FString, struct FST_S3HintTalkData>    Data;                                                     // 0x0028(0x0050) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Shenmue3.HintTalkData");
		return ptr;
	}

};


// Class Shenmue3.IfTask
// 0x0040 (0x00A0 - 0x0060)
class UIfTask : public UTalkEventTaskBase
{
public:
	struct FString                                     Expression;                                               // 0x0060(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	struct FString                                     TrueLabelName;                                            // 0x0070(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	int                                                TrueLabelIndex;                                           // 0x0080(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0084(0x0004) MISSED OFFSET
	struct FString                                     FalseLabelName;                                           // 0x0088(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	int                                                FalseLabelIndex;                                          // 0x0098(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	bool                                               Result;                                                   // 0x009C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x009D(0x0003) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Shenmue3.IfTask");
		return ptr;
	}

};


// Class Shenmue3.InfoTask
// 0x0018 (0x0078 - 0x0060)
class UInfoTask : public UTalkEventTaskBase
{
public:
	int                                                FlagNum;                                                  // 0x0060(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0064(0x0004) MISSED OFFSET
	struct FString                                     Value;                                                    // 0x0068(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Shenmue3.InfoTask");
		return ptr;
	}

};


// Class Shenmue3.Imaginary
// 0x0020 (0x0080 - 0x0060)
class UImaginary : public UTalkEventTaskBase
{
public:
	struct FString                                     TargetID;                                                 // 0x0060(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	struct FString                                     ImaginaryCommand;                                         // 0x0070(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Shenmue3.Imaginary");
		return ptr;
	}

};


// Class Shenmue3.IsBootTrigger
// 0x0000 (0x0028 - 0x0028)
class UIsBootTrigger : public UScriptEventTriggerBase
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Shenmue3.IsBootTrigger");
		return ptr;
	}

};


// Class Shenmue3.IsConnectTrigger
// 0x0018 (0x0040 - 0x0028)
class UIsConnectTrigger : public UScriptEventTriggerBase
{
public:
	struct FString                                     TagName;                                                  // 0x0028(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	int                                                MinStep;                                                  // 0x0038(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                MaxStep;                                                  // 0x003C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Shenmue3.IsConnectTrigger");
		return ptr;
	}

};


// Class Shenmue3.InventoryTask
// 0x0010 (0x0070 - 0x0060)
class UInventoryTask : public UTalkEventTaskBase
{
public:
	struct FString                                     UseItemSetId;                                             // 0x0060(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Shenmue3.InventoryTask");
		return ptr;
	}

};


// Class Shenmue3.KsLabelTask
// 0x0018 (0x0078 - 0x0060)
class UKsLabelTask : public UTalkEventTaskBase
{
public:
	bool                                               useTimer;                                                 // 0x0060(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0061(0x0003) MISSED OFFSET
	float                                              limitTime;                                                // 0x0064(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	TArray<struct FString>                             messageLabels;                                            // 0x0068(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Shenmue3.KsLabelTask");
		return ptr;
	}

};


// Class Shenmue3.KSLabelNoCancelTask
// 0x0000 (0x0078 - 0x0078)
class UKSLabelNoCancelTask : public UKsLabelTask
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Shenmue3.KSLabelNoCancelTask");
		return ptr;
	}

};


// Class Shenmue3.HelpPriorityTask
// 0x0018 (0x0078 - 0x0060)
class UHelpPriorityTask : public UTalkEventTaskBase
{
public:
	struct FString                                     HelpId;                                                   // 0x0060(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	bool                                               bStartFlag;                                               // 0x0070(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0071(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Shenmue3.HelpPriorityTask");
		return ptr;
	}

};


// Class Shenmue3.ItemTask
// 0x0018 (0x0078 - 0x0060)
class UItemTask : public UTalkEventTaskBase
{
public:
	int                                                FlagNum;                                                  // 0x0060(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0064(0x0004) MISSED OFFSET
	struct FString                                     Value;                                                    // 0x0068(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Shenmue3.ItemTask");
		return ptr;
	}

};


// Class Shenmue3.KsSelectTask
// 0x0030 (0x0090 - 0x0060)
class UKsSelectTask : public UTalkEventTaskBase
{
public:
	TArray<struct FKsJumpLabel>                        jumpLabels;                                               // 0x0060(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	TArray<int>                                        LabelIndex;                                               // 0x0070(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	unsigned char                                      UnknownData00[0x10];                                      // 0x0080(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Shenmue3.KsSelectTask");
		return ptr;
	}


	void SetSelectKeywordIndex(int new_index);
};


// Class Shenmue3.KsVisibilityTask
// 0x0018 (0x0078 - 0x0060)
class UKsVisibilityTask : public UTalkEventTaskBase
{
public:
	TArray<struct FString>                             Extention;                                                // 0x0060(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	bool                                               bUnknown;                                                 // 0x0070(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0071(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Shenmue3.KsVisibilityTask");
		return ptr;
	}

};


// Class Shenmue3.LabelTask
// 0x0010 (0x0070 - 0x0060)
class ULabelTask : public UTalkEventTaskBase
{
public:
	struct FString                                     labelName;                                                // 0x0060(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Shenmue3.LabelTask");
		return ptr;
	}

};


// Class Shenmue3.LeadActorExitTask
// 0x0000 (0x0060 - 0x0060)
class ULeadActorExitTask : public UTalkEventTaskBase
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Shenmue3.LeadActorExitTask");
		return ptr;
	}

};


// Class Shenmue3.LoadLevelTask
// 0x0010 (0x0070 - 0x0060)
class ULoadLevelTask : public UTalkEventTaskBase
{
public:
	struct FString                                     LoadLevelName;                                            // 0x0060(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Shenmue3.LoadLevelTask");
		return ptr;
	}

};


// Class Shenmue3.LoadPositionAndRotationTask
// 0x0020 (0x0080 - 0x0060)
class ULoadPositionAndRotationTask : public UTalkEventTaskBase
{
public:
	struct FString                                     TargetActorID;                                            // 0x0060(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	struct FString                                     VariableName;                                             // 0x0070(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Shenmue3.LoadPositionAndRotationTask");
		return ptr;
	}

};


// Class Shenmue3.LoadPositionTask
// 0x0020 (0x0080 - 0x0060)
class ULoadPositionTask : public UTalkEventTaskBase
{
public:
	struct FString                                     TargetActorID;                                            // 0x0060(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	struct FString                                     VariableName;                                             // 0x0070(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Shenmue3.LoadPositionTask");
		return ptr;
	}

};


// Class Shenmue3.LoadRotationTask
// 0x0020 (0x0080 - 0x0060)
class ULoadRotationTask : public UTalkEventTaskBase
{
public:
	struct FString                                     TargetActorID;                                            // 0x0060(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	struct FString                                     VariableName;                                             // 0x0070(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Shenmue3.LoadRotationTask");
		return ptr;
	}

};


// Class Shenmue3.LookAtTask
// 0x0030 (0x0090 - 0x0060)
class ULookAtTask : public UTalkEventTaskBase
{
public:
	struct FString                                     motionActorId;                                            // 0x0060(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	struct FString                                     lookTargetId;                                             // 0x0070(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	int                                                motionType;                                               // 0x0080(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                motionProc;                                               // 0x0084(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	float                                              DelayTime;                                                // 0x0088(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x008C(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Shenmue3.LookAtTask");
		return ptr;
	}

};


// Class Shenmue3.LookTask
// 0x0030 (0x0090 - 0x0060)
class ULookTask : public UTalkEventTaskBase
{
public:
	struct FString                                     CharacterID;                                              // 0x0060(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	struct FString                                     lookTargetId;                                             // 0x0070(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	float                                              OffsetYaw;                                                // 0x0080(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	float                                              OffsetPitch;                                              // 0x0084(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	float                                              DelayTime;                                                // 0x0088(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x008C(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Shenmue3.LookTask");
		return ptr;
	}

};


// Class Shenmue3.TalkScript
// 0x0050 (0x0078 - 0x0028)
class UTalkScript : public UObject
{
public:
	TArray<class UTalkEventTaskBase*>                  EventData;                                                // 0x0028(0x0010) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst)
	TArray<struct FString>                             JoinActorIDs;                                             // 0x0038(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	float                                              NoVoiceWaitTime;                                          // 0x0048(0x0004) (Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData)
	bool                                               IsAcScript;                                               // 0x004C(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x004D(0x0003) MISSED OFFSET
	int                                                NumMiniGameTasks;                                         // 0x0050(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x0054(0x0004) MISSED OFFSET
	TArray<class UObject*>                             PreloadAssets;                                            // 0x0058(0x0010) (ZeroConstructor)
	unsigned char                                      UnknownData02[0x10];                                      // 0x0068(0x0010) UNKNOWN PROPERTY: ArrayProperty Shenmue3.TalkScript.PreloadSoftAssets

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Shenmue3.TalkScript");
		return ptr;
	}


	void Init();
};


// Class Shenmue3.LookSpeedTask
// 0x0008 (0x0098 - 0x0090)
class ULookSpeedTask : public ULookTask
{
public:
	float                                              InterpSpeed;                                              // 0x0090(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0094(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Shenmue3.LookSpeedTask");
		return ptr;
	}

};


// Class Shenmue3.MainFlowScript
// 0x0010 (0x0088 - 0x0078)
class UMainFlowScript : public UTalkScript
{
public:
	TArray<class UScriptEventTriggerBase*>             TriggerData;                                              // 0x0078(0x0010) (Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Shenmue3.MainFlowScript");
		return ptr;
	}

};


// Class Shenmue3.MG_CC_AnimalBase
// 0x0030 (0x0770 - 0x0740)
class AMG_CC_AnimalBase : public ACharacter
{
public:
	struct FMG_CC_MoveData                             m_WalkMoveData;                                           // 0x0740(0x000C) (BlueprintVisible)
	struct FMG_CC_MoveData                             m_RunMoveData;                                            // 0x074C(0x000C) (BlueprintVisible)
	float                                              m_MoveDistanceFromCenter;                                 // 0x0758(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              m_WaitTime;                                               // 0x075C(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              m_MaxNotCatchTime;                                        // 0x0760(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0xC];                                       // 0x0764(0x000C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Shenmue3.MG_CC_AnimalBase");
		return ptr;
	}

};


// Class Shenmue3.ExpressionFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UExpressionFunctionLibrary : public UBlueprintFunctionLibrary
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Shenmue3.ExpressionFunctionLibrary");
		return ptr;
	}


	struct FString Replace(const struct FString& InStr, int leftInd, int rightInd, int NewNum);
	bool GetExpressionFromOperator(const struct FString& InStr, int operatorInd, int* lNum, int* rNum, int* lInd, int* rInd);
	bool GetExpressionFromComparison(const struct FString& InStr, int operatorInd, TEnumAsByte<EComparisonKind> comparisonKind, int* lNum, int* rNum, int* lInd, int* rInd, struct FString* lStr, struct FString* rStr);
	bool FindSub(const struct FString& InStr, int* findInd);
	bool FindParenBlock(const struct FString& InStr, int* leftInd, int* rightInd, struct FString* retStr);
	bool FindMul(const struct FString& InStr, int* findInd);
	bool FindMod(const struct FString& InStr, int* findInd);
	int FindFirstOperator(const struct FString& InStr, TEnumAsByte<ESearchDir> SearchDir, struct FString* findOperator);
	bool FindDiv(const struct FString& InStr, int* findInd);
	bool FindComparison(const struct FString& InStr, TEnumAsByte<EComparisonKind> comparisonKind, int* findInd);
	bool FindAdd(const struct FString& InStr, int* findInd);
	struct FString EvaluateAllFlags(const struct FString& InStr);
};


// Class Shenmue3.MG_RCFork_DataAsset
// 0x00B0 (0x00E0 - 0x0030)
class UMG_RCFork_DataAsset : public UDataAsset
{
public:
	struct FMG_RCForkData                              m_rcfork_data;                                            // 0x0030(0x0060) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FMG_RCForkDebugData                         m_rcfork_debug_data;                                      // 0x0090(0x004C) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      UnknownData00[0x4];                                       // 0x00DC(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Shenmue3.MG_RCFork_DataAsset");
		return ptr;
	}

};


// Class Shenmue3.MG_WMData
// 0x0010 (0x0040 - 0x0030)
class UMG_WMData : public UDataAsset
{
public:
	TArray<struct FMG_WMRoundDataStruct>               m_RoundDataList;                                          // 0x0030(0x0010) (Edit, ZeroConstructor)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Shenmue3.MG_WMData");
		return ptr;
	}


	bool IsEnableMole(int RoundNum, float CurrentTime, int AppearCount, struct FMG_WMDataStruct* ReturnData);
	int GetToatalRoundNum();
	float GetRoundMaxTime(int RoundNum);
	int GetMoleNum(int RoundNum);
};


// Class Shenmue3.MGForkliftRCFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UMGForkliftRCFunctionLibrary : public UBlueprintFunctionLibrary
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Shenmue3.MGForkliftRCFunctionLibrary");
		return ptr;
	}


	void SetVehicleWheelOffset(class UWheeledVehicleMovementComponent* wheel_vehicle_movement_component, TArray<struct FVector> Offset, int Size);
	struct FMGForkliftRCCowTableRowBase GetRowByNameCowDataTable(class UDataTable* DataTable, const struct FName& pName, bool* Result);
};


// Class Shenmue3.MuteFadeSoundTask
// 0x0008 (0x0068 - 0x0060)
class UMuteFadeSoundTask : public UTalkEventTaskBase
{
public:
	bool                                               bMute;                                                    // 0x0060(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0061(0x0003) MISSED OFFSET
	int                                                Target;                                                   // 0x0064(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Shenmue3.MuteFadeSoundTask");
		return ptr;
	}

};


// Class Shenmue3.NPCReactionAnimMetaData
// 0x0018 (0x0040 - 0x0028)
class UNPCReactionAnimMetaData : public UAnimMetaData
{
public:
	TEnumAsByte<EReactionOnTalk>                       ReactionType;                                             // 0x0028(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	EFurimukiOnTalk                                    ManualFurimukiType;                                       // 0x0029(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x2];                                       // 0x002A(0x0002) MISSED OFFSET
	float                                              PauseTime;                                                // 0x002C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAnimSequence*                               ChangeAnimation;                                          // 0x0030(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bNoReactFromBehind;                                       // 0x0038(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bLookUp;                                                  // 0x0039(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x6];                                       // 0x003A(0x0006) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Shenmue3.NPCReactionAnimMetaData");
		return ptr;
	}

};


// Class Shenmue3.MotionTask
// 0x0058 (0x00B8 - 0x0060)
class UMotionTask : public UTalkEventTaskBase
{
public:
	struct FString                                     CharacterID;                                              // 0x0060(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	unsigned char                                      UnknownData00[0x28];                                      // 0x0070(0x0028) UNKNOWN PROPERTY: SoftObjectProperty Shenmue3.MotionTask.MontagePath
	struct FString                                     SectionName;                                              // 0x0098(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	bool                                               bUseBlend;                                                // 0x00A8(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x00A9(0x0003) MISSED OFFSET
	float                                              BlendTime;                                                // 0x00AC(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
