#pragma once

// Name: Shenmue3, Version: 1.0.2

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct ST_ClothingCategory.ST_ClothingCategory
// 0x0110
struct FST_ClothingCategory
{
	TArray<struct FName>                               Tshirt_3_0101593845E6888B8115A8ADF16213E2;                // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<struct FName>                               Jacket_5_3B9D5F894EECA95B36E6548F104E613C;                // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<struct FName>                               Jeans_7_388CF97D4AF5F7D8C00AB0B0F470EEBE;                 // 0x0020(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<struct FName>                               Shoes_9_6D1E92394120B11C447D468A89872DB2;                 // 0x0030(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<struct FName>                               TopKen_20_9930FAC646CD9D39685E799001786DD7;               // 0x0040(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<struct FName>                               BottomKen_21_B8E285D54883519F40D3D3BAC12B5450;            // 0x0050(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<struct FName>                               ShoesKen_22_733B3E8342C491352FE3A690A42CFF0E;             // 0x0060(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<struct FName>                               ShirtKen_26_73B1B8EC4C6345877C304CAEC03DBA78;             // 0x0070(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<struct FName>                               FlightJacket_30_D249098C44F31E1B7485EA8BF5C45286;         // 0x0080(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<struct FName>                               SHe_Hat_44_2918C36C44FA8DA7B97CC39087CA45D4;              // 0x0090(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<struct FName>                               SHE_Top_41_7BABC5BA481B8DBA29F2D49C845B711E;              // 0x00A0(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<struct FName>                               SHE_Bottom_42_661FEE0A4BF37EEA0C7D45829E68C87B;           // 0x00B0(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<struct FName>                               SHE_Shoes_43_9C8098F240B0E630C622018C11B019C7;            // 0x00C0(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<struct FName>                               SHe_HatWaka_51_7A57E72E4FB2E8C698A655B0BE9FE836;          // 0x00D0(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<struct FName>                               SHE_TopWaka_52_19AEE4E0406FEC14E9A7AFBD7741A1BD;          // 0x00E0(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<struct FName>                               SHE_BottomWaka_54_634A575842F1F56D2BE759B6EDF105F8;       // 0x00F0(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<struct FName>                               SHE_Shoes_Waka_55_8639F5B342CE5197D725128409075123;       // 0x0100(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
