#pragma once

// Name: Shenmue3SDK, Version: 1.4.1

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct ST_CCBattle_CharParams.ST_CCBattle_CharParams
// 0x0020
struct FST_CCBattle_CharParams
{
	int                                                HP_MAX_66_5CCF6A2749BF48D55651F4B871FC43FA;               // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                ATK_DMG_50_3F3AE21A4A5D08C4435524AFBC597756;              // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                ATK_PUSH_53_62493BBF43449E85C99711B871933E7D;             // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                RES_PUSH_55_270B25544E1E73B997CC98B8933B7E2A;             // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                GUARD_RES_DMG_65_6B41A9454640A324E6EAD8A13712C300;        // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                GUARD_RES_PUSH_63_87796E89495345C6CD0EEB944ACDA710;       // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                SPEED_59_5B85CE874295A2FE821299BEEA8EFFF0;                // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                JUMP_61_4F478B4346AF285CD40F3F9C8B45FC60;                 // 0x001C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
