#pragma once

// Name: Shenmue3SDK, Version: 1.4.1

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct ST_dateNameString_weekday.ST_dateNameString_weekday
// 0x00A8
struct FST_dateNameString_weekday
{
	struct FText                                       sun_14_0FF623444A3CD0B4ED30E0A492E04A75;                  // 0x0000(0x0018) (Edit, BlueprintVisible)
	struct FText                                       mon_15_03FB2078435289A6F6B89AB0A25965A0;                  // 0x0018(0x0018) (Edit, BlueprintVisible)
	struct FText                                       tue_16_11A2C76A4B94367A105DBD9B1C4DF439;                  // 0x0030(0x0018) (Edit, BlueprintVisible)
	struct FText                                       wed_17_E76ECF09484608B2AB1A4EA7DF1CDDFE;                  // 0x0048(0x0018) (Edit, BlueprintVisible)
	struct FText                                       thu_19_2228CEDE46ECE4AA102577A1BA68F5B0;                  // 0x0060(0x0018) (Edit, BlueprintVisible)
	struct FText                                       fri_20_AE7C40F04CB552B337D695B74FFF50F3;                  // 0x0078(0x0018) (Edit, BlueprintVisible)
	struct FText                                       sat_21_F07A25EA49DD33AD37EE5099A78403C0;                  // 0x0090(0x0018) (Edit, BlueprintVisible)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
