#pragma once

// Name: Shenmue3SDK, Version: 1.4.1

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct ST_MemoTest2.ST_MemoTest2
// 0x0020
struct FST_MemoTest2
{
	int                                                MemoNo_0_2_077A517647A62464FFA192B612F64E03;              // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                MemoNo_1_7_086AB53542B063E8A41571AE3173233A;              // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                MemoNo_2_8_D5287E614B1C0EABCA5A0CABFED59669;              // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                MemoNo_3_9_47E4FF97419ABFC298F7FEBA3D0AFAA0;              // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                MemoNo_4_12_8F76F1194607D27019E17D8E6F40AC19;             // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                MemoNo_5_15_649BC64E4706CBC82FA6B08C35362A18;             // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                MemoNo_6_19_701F30674563DC04F8D1CFB51D7B726F;             // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                MemoNo_7_21_0C5FF9B04F8AA54657CAE18B10A641A0;             // 0x001C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
